{
    "meta": {
        "title": "Barrierefreiheitserklärung des Robert Koch-Instituts und des Bundesministeriums für Gesundheit",
        "description": ""
    },
    "title": "Barrierefreiheitserklärung des Robert Koch-Instituts und des Bundesministeriums für Gesundheit",
    "section-website-main": {
        "textblock": [
            "Diese Erklärung zur Barrierefreiheit gilt für die aktuell auf www.coronawarn.app erreichbare Website des Robert Koch-Instituts.",
            "Das Robert Koch-Institut arbeitet daran, seine Website im Einklang mit dem Behindertengleichstellungsgesetz (BGG) und der Barrierefreie-Informationstechnik-Verordnung (BITV 2.0) barrierefrei zugänglich zu machen. Im Rahmen eines internen Tests wurde festgestellt, dass die unter www.coronawarn.app aktuell erreichbare Website nicht vollständig barrierefrei gestaltet ist. Sobald die Überarbeitung abgeschlossen ist, wird die Barrierefreiheit der Internetseite des Robert Koch-Instituts vom unabhängigen BITV-Test-Prüfverbund getestet und das Testergebnis sodann an dieser Stelle veröffentlicht werden."
        ]
    },
    "section-android-main": {
        "textblock": [
            "Diese Erklärung zur Barrierefreiheit gilt für Version 2.17 der <b>Corona-Warn-App (Android)</b> des Robert Koch-Instituts und des Bundesministeriums für Gesundheit.",
            "Als öffentliche Stelle im Sinne der Richtlinie (EU) 2016/2102 sind wir bemüht, unsere Websites und mobilen Anwendungen im Einklang mit den Bestimmungen des Behindertengleichstellungsgesetzes des Bundes (BGG) sowie der Barrierefreien-Informationstechnik-Verordnung (BITV 2.0) zur Umsetzung der Richtlinie (EU) 2016/2102 barrierefrei zugänglich zu machen."
        ]
    },
    "section-ios-main": {
        "textblock": [
            "Diese Erklärung zur Barrierefreiheit gilt für Version 2.17 der <b>Corona-Warn-App (iOS)</b> des Robert Koch-Instituts und des Bundesministeriums für Gesundheit.",
            "Als öffentliche Stelle im Sinne der Richtlinie (EU) 2016/2102 sind wir bemüht, unsere Websites und mobilen Anwendungen im Einklang mit den Bestimmungen des Behindertengleichstellungsgesetzes des Bundes (BGG) sowie der Barrierefreien-Informationstechnik-Verordnung (BITV 2.0) zur Umsetzung der Richtlinie (EU) 2016/2102 barrierefrei zugänglich zu machen."
        ]
    },
    "section-website-compatibility-level": {
        "title": "Stand der Vereinbarkeit mit den Anforderungen",
        "textblock": [
            "<b>Stand der Vereinbarkeit mit den Anforderungen</b>",
            "Diese Webseite ist wegen der folgenden Ausnahmen teilweise nicht mit dem BGG und der BITV 2.0 vereinbar.",
            "<b>Nicht barrierefreie Inhalte auf der Webseite www.coronawarn.app</b>",
            "<p>Die nachstehend aufgeführten Inhalte sind wegen Unvereinbarkeit mit dem BGG und der BITV 2.0 nicht barrierefrei. Wir arbeiten an der baldmöglichen Beseitigung:</p>",
            "<ul> <li>Die interaktiven Diagramme sind noch nicht in vollem Umfang für Menschen mit Sehbeeinträchtigungen zugänglich.</li> <li>Farbfehlsichtigkeit kann sich negativ auf die Lesbarkeit der Diagramme auswirken.</li> <li>Ältere PDF-Dateien der Nutzungsbedingungen und Datenschutzerklärung sind ggf. nicht barrierefrei. Später eingestellte PDF-Dateien werden in barrierefreier Version erstellt beziehungsweise schnellstmöglich durch eine solche ersetzt.</li> <li>PDF-Dateien. Diese enthalten unvollständige Alternativtexte. Die Tastaturbedienbarkeit ist nicht vollständig gegeben. Zum Teil sind Kontrastfehler enthalten.</li> <li>Benutzerdefinierte Einstellungen: Farben (z.&nbsp;B. Dark Mode), Kontraste und Fokus Cursor werden nicht korrekt unterstützt.</li></ul>"
        ]
    },
    "section-android-compatibility-level": {
        "title": "Stand der Vereinbarkeit mit den Anforderungen",
        "textblock": [
            "Die Anforderungen der Barrierefreiheit für mobile Anwendungen ergeben sich aus der BITV 2.0 in ihrer jeweils gültigen Fassung, die auf der Grundlage von § 12d BGG erlassen wurde.",
            "Die Überprüfung der Einhaltung der Anforderungen der Corona-Warn-App (Android) beruht auf einer am 18.01.2022 durchgeführten Selbstbewertung.",
            "<b>Die nachstehend aufgeführten Inhalte der Corona-Warn-App (Android) sind aus folgenden Gründen nicht barrierefrei:</b><ul><li>Der Inhalt der App ist entgegen der Anforderung 1.3.4 WCAG 2.1 bzw. 11.1.3.4 EN 301 549 V3.2.1 auf die Anzeige im Hochformat beschränkt.</li><li>Das dargestellte Kontrastverhältnis bei der visuellen Darstellung von Text und Bildern von Text weicht im Falle von „Label Text“ leicht von der Anforderung 1.4.3 WCAG 2.1 bzw. 11.1.4.3 EN 301 549 V3.2.1 ab. Der minimale Kontrast liegt hier bei 4.48:1 statt bei 4.5:1.</li><li>Bei Vergrößerung von Text (ohne assistierende Technik um bis zu 200 %) über die Betriebssystemeinstellungen kann es entgegen der Anforderung 1.4.4 WCAG 2.1 bzw. 11.1.4.4.1 EN 301 549 V3.2.1 zum Überlappen von Textabschnitten kommen.</li><li>Entgegen Anforderung 4.1.2 WCAG 2.1 nach 11.4.1.2.1 EN 301 549 V3.2.1 werden nicht alle Elemente korrekt durch die Sprachausgabe dargestellt. Der User Flow wird dadurch allerdings nicht blockiert.</li></ul>",
            "Wir arbeiten an der baldmöglichsten Beseitigung der aufgelisteten Barrieren.",
            "<b>Datum der Erstellung bzw. der letzten Aktualisierung der Erklärung</b>",
            "Diese Erklärung wurde am 21.02.2022 erstellt."
        ]
    },
    "section-ios-compatibility-level": {
        "title": "Stand der Vereinbarkeit mit den Anforderungen",
        "textblock": [
            "Die Anforderungen der Barrierefreiheit für mobile Anwendungen ergeben sich aus der BITV 2.0 in ihrer jeweils gültigen Fassung, die auf der Grundlage von § 12d BGG erlassen wurde.",
            "Die Überprüfung der Einhaltung der Anforderungen der Corona-Warn-App (iOS) beruht auf einer am 18.01.2022 durchgeführten Selbstbewertung.",
            "<b>Die nachstehend aufgeführten Inhalte der Corona-Warn-App (iOS) sind aus folgenden Gründen nicht barrierefrei:</b><ul><li>Der Inhalt der App ist entgegen der Anforderung 1.3.4 WCAG 2.1 bzw. 11.1.3.4 EN 301 549 V3.2.1 auf die Anzeige im Hochformat beschränkt.</li><li>Das dargestellte Kontrastverhältnis bei der visuellen Darstellung von Text und Bildern von Text im Falle der Beschriftungstexte der Navigationsleiste von der Anforderung 1.4.3 WCAG 2.1 bzw. 11.1.4.3 EN 301 549 V3.2.1 ab.</li><li>Bei Vergrößerung von Text (ohne assistierende Technik um bis zu 200 %) kann es entgegen der Anforderung 1.4.4 WCAG 2.1 bzw. 11.1.4.4.1 EN 301 549 V3.2.1 zur fehlenden Vergrößerung oder zum Abschneiden von Textfeldern kommen.</li><li>Das Nachstehende zur Funktionalität gilt für an das Endgerät angeschlossene, physische Tastaturen. Entgegen der Anforderung 2.1.1 WCAG 2.1 bzw. 11.2.1.1.1 EN 301 549 V3.2.1 ist keine Tastaturnutzung auf der Seite „Nutzungsbedingungen“ sowie „Datenschutz“ möglich. Auf den Seiten „Personen bearbeiten“ und „Orte bearbeiten“ können Inhalte zudem nicht mittels Tastaturnutzung gelöscht werden.</li><li>Auf den Seiten „Personen bearbeiten“ und „Orte bearbeiten“ kann die Löschtaste entgegen Anforderung 2.5.1 WCAG 2.1 bzw. 11.2.5.1 EN 301 549 V3.2.1 nicht mit einer einzelnen Zeigeraktion freigelegt werden.</li></ul>",
            "Wir arbeiten an der baldmöglichsten Beseitigung der aufgelisteten Barrieren.",
            "<b>Datum der Erstellung bzw. der letzten Aktualisierung der Erklärung</b>",
            "Diese Erklärung wurde am 21.02.2022 erstellt."
        ]
    },
    "section-report-barriers": {
        "headline": {
        "title": "Barrieren melden: Kontakt zu den Ansprechpartnern",
        "text": "Sie möchten uns bestehende Barrieren mitteilen oder Informationen zur Umsetzung der Barrierefreiheit erfragen? Gerne können Sie sich per <a href='coronawarnapp...rki...de' class='email'>E-Mail</a> oder über unser <a href='https://www.rki.de/SharedDocs/Kontaktformulare/weitere/Corona-Warn-App/Corona-Warn-App_Integrator.html' target='_blank' rel='noopener noreferrer'>Kontaktformular</a> bei uns melden."
        }
    },
    "section-arbitrary-service": {
        "title": "Schlichtungsverfahren",
        "textblock": [
            "Wenn auch nach Ihrem Feedback an den oben genannten Kontakt keine zufriedenstellende Lösung gefunden wurde, können Sie sich an die Schlichtungsstelle nach § 16 BGG wenden. Die Schlichtungsstelle BGG hat die Aufgabe, bei Konflikten zum Thema Barrierefreiheit zwischen Menschen mit Behinderungen und öffentlichen Stellen des Bundes eine außergerichtliche Streitbeilegung zu unterstützen. Das Schlichtungsverfahren ist kostenlos. Es muss kein Rechtsbeistand eingeschaltet werden. Weitere Informationen zum Schlichtungsverfahren und den Möglichkeiten der Antragstellung finden sie auf der <a href='https://www.schlichtungsstelle-bgg.de' target='_blank' rel='noopener noreferrer'>Webseite der Schlichtungsstelle</a>.",
            "Sie erreichen die Schlichtungsstelle unter folgender Adresse:",
            "Schlichtungsstelle nach dem Behindertengleichstellungsgesetz bei dem Beauftragten der Bundesregierung für die Belange von Menschen mit Behinderungen<br/>Mauerstraße 53<br/>10117 Berlin<br/>Telefon: +49 30 18 527-2805<br/>Fax: +49 30 18 527-2901<br/>E-Mail: <a href='info...schlichtungsstelle-bgg...de' class='email'>info@schlichtungsstelle-bgg.de</a><br/>Internet: <a href='https://www.schlichtungsstelle-bgg.de' target='_blank' rel='noopener noreferrer'>https://www.schlichtungsstelle-bgg.de</a>"
        ]
    }
}
