{
    "section-main": {
        "headline": {
            "title": "Los geht's",
            "textblock": [
                "Willkommen in der Corona-Warn-App-Community!",
                "Wenn Du mehr darüber erfahren möchtest, wie Du bei uns mitmachen kannst, bist Du hier genau richtig. Nachfolgend findest Du Infos, wie Du bei uns mitarbeiten und zum Code und der Dokumentation der Corona-Warn-App beitragen kannst. Los geht's!"
            ]
        },
        "content": {
            "headline": {
                "title": "Mitarbeit am Projekt",
                "text": "Alle können Mitglied der Projekt-Community werden. Wir rufen alle Interessierten auf, mitzumachen und Teil der Entwickler-Community zu werden. Es gibt verschiedene Möglichkeiten mitzuarbeiten."
            },
           "simple-list": {
                "image": {
                    "url": "/assets/img/community.svg",
                    "right": true,
                    "alt": "Community icon"
                },
                "title": "Richtlinien zur Beteiligung",
                "text": "Alle Mitglieder der Projekt-Community müssen sich an den 'Contributor Covenant', Version 2.0, halten. Nur wenn wir uns gegenseitig respektieren, können wir produktiv in der Community zusammenarbeiten. Unsere speziellen Richtlinien kannst Du im <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODE_OF_CONDUCT.md' target='_blank' rel='noopener noreferrer' title=''>Code of Conduct</a> nachlesen."
            }
        }
    },
    "section-contribute-listing": {
        "headline": {
            "title": "Mitarbeit am Projekt",
            "sub-headline": "Du kannst einen Pull Request in GitHub senden.",
            "text": "Für jeden Beitrag gilt ganz allgemein: Bitte mache so viele Angaben wie möglich, um die Zusammenarbeit zu erleichtern und halte Dich dabei an die Anleitungen in der CONTRIBUTING.md Datei des jeweiligen Repository. Wenn Du einen Pull Request anlegst, gehe nach der Pull-Request-Checkliste in der entsprechenden CONTRIBUTING.md Datei vor, damit umgehend Reviews erfolgen können. Wenn Du intensiver mitarbeiten möchtest, schreibe uns eine E-Mail an <a href='mailto:corona-warn-app.opensource@sap.com' title=''>email</a>. So vermeiden wir unnötige Arbeiten und bekommen alle wertvolle Anregungen."
        },
        "content": {
            "sub-headline": "Wenn Du zum ersten Mal mitmachst, gehe wie nachfolgend beschrieben vor:",
            "feature-list": [{
                "image": {
                    "title": "Issue",
                    "url": "/assets/img/icons/issue.svg",
                    "alt": "'Issue'-icon"
                },
                "title": "An einem 'Issue' arbeiten",
                "text": "Wenn Du ein Issue übernehmen möchtest, lege zunächst auf GitHub einen Kommentar dazu an mit der Info, dass Du daran arbeiten möchtest."
            },{
                "image": {
                    "title": "Fragen",
                    "url": "/assets/img/icons/questions.svg",
                    "alt": "Fragen-icon"
                },
                "title": "Eine Frage stellen",
                "text": "Um einen Punkt zu klären, schreibe einfach einen Kommentar dazu. Jemand aus der Gruppe der verantwortlichen Personen wird darauf antworten."
            },{
                "image": {
                    "title": "Dokumentation",
                    "url": "/assets/img/icons/documentation.svg",
                    "alt": "Dokumentation-icon"
                },
                "title": "Code oder Dokumentation beitragen",
                "text": "Um einen Fehler zu beheben oder eine neue Funktion zu implementieren, muss der Beitrag unter <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/LICENSE' target='_blank' rel='noopener noreferrer'>Apache 2.0 License</a> lizensiert sein."
            },{
                "image": {
                    "title": "Verbesserung",
                    "url": "/assets/img/icons/improvement.svg",
                    "alt": "Verbesserung-icon"
                },
                "title": "Eine einfache Korrektur oder eine Verbesserung melden",
                "text": "Lege einen Pull Request an, in dem Du eine für den Code verantwortliche Person im entsprechenden Repository ansprichst (siehe z. B. die der Dokumentations-Repo <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODEOWNERS' target='_blank' rel='noopener noreferrer' title='Code Owners'>Code Owners</a>)."
            },{
                "image": {
                    "title": "Sicherheitsrisiko",
                    "url": "/assets/img/icons/security.svg",
                    "alt": "Sicherheitsrisiko-icon"
                },
                "title": "Ein wesentliches Sicherheitsrisiko melden",
                "text": "Folge hierbei dem in der Sicherheitsrichtlinie beschriebenen Prozess. Die Richtlinie kann über die Registerkarte Security im jeweiligen Entwicklungs-Repository abgerufen werden."
            }]
        },
        "text": "Mache bei allen oben genannten Aktivitäten so viele Angaben wie möglich. Beachte bitte in jedem Fall die speziellen Anleitungen zur Mitarbeit im jeweiligen Repository.",
        "box": {
            "class": "wide",
             "image": {
                    "url": "/assets/img/ideas.svg",
                    "title": "Ideen",
                    "alt": "Ideen-icon"
            },
            "content": {
                "title": "Willst Du Dich mehr einbringen?",
                "text": "Falls Du Dich noch mehr einbringen möchtest, schicke uns bitte eine <a href='mailto:corona-warn-app.opensource@sap.com' target='_blank' rel='noopener noreferrer' title=''>E-Mail</a>. Wir freuen uns auf alle neuen Ideen!"
            }
        }
    },
    "section-start-contribute": {
        "headline":{
            "title": "Mach jetzt mit!",
            "button": {
                "title": "Hier geht's zu GitHub",
                "url": "https://github.com/corona-warn-app",
                "icon": "github",
                "external": true
            }
        }
    }
}
