{
    "section-notice": {
        "textblock": [
            "<div class='update'>The Corona-Warn-App (CWA) will no longer be developed as of June 1, 2023. The information on this page is therefore no longer up-to-date. Until April 30, 2023, it was still possible to transmit error reports from the app to the development team. After that, it was possible to report any bugs and errors up until May 31, 2023. However, bug fixes were only created for those bugs that were reported until May 15, 2023. As of May 16, 2023, GitHub repositories began to be archived and it is no longer possible to open new issues. The <a href='https://github.com/corona-warn-app/cwa-website' target='_blank' rel='noopener noreferrer'>repository for the coronawarn.app website</a> is an exception, as the website will be maintained until further notice. The source code of the CWA, as well as the associated Issues and Pull Requests will remain accessible in the <a href='https://github.com/corona-warn-app' target='_blank' rel='noopener noreferrer'>GitHub repositories</a>. How long this information can be accessed depends on the processes and policies at GitHub. For more information, click here: <a href='../faq/results/#ramp_down' target='_blank'> What is the background for the end of the development of the CWA?</a></div>"
        ]
    },
    "section-main": {
        "headline": {
            "title": "Get Started",
            "textblock": [
                "Welcome to the Corona-Warn-App community!",
                "If you are looking for information on how to join us, you have come to the right place. Read on to find out how you can get involved and contribute to Corona-Warn-App code and documentation.",
                "You can also <a href='#socialmedia'>follow us on Twitter and Instagram</a>, catch up on the latest developments and chat with other followers.",
                "Let's get started!"
            ]
        },
        "content": {
            "headline": {
                "title": "Contributing",
                "text": "Anyone can become a member of the project’s community. We encourage everyone interested to contribute and become part of our developer community. There are different ways for you to get involved."
            },
            "simple-list": {
                "image": {
                    "url": "/assets/img/community.svg",
                    "right": true,
                    "alt": ""
                },
                "title": "Contribution rules",
                "text": "All members of the project community must abide by the Contributor Covenant, version 2.0. Only by respecting each other can we develop a productive, collaborative community. For our specific guidelines, read the <a href='https://github.com/corona-warn-app/cwa-documentation/blob/main/CODE_OF_CONDUCT.md' target='_blank' rel='noopener noreferrer' title=''>Code of Conduct</a>."
            }
        }
    },
    "section-contribute-listing": {
        "headline": {
            "title": "Get involved",
            "subtitle": "You can submit a pull request in GitHub",
            "text": "As a general rule for any contribution: please make sure you provide as much information as you can to ease collaboration and follow the instructions noted in the CONTRIBUTING.md file of the repository you plan to contribute to. When creating a pull request, follow the Pull Request Checklist available in the respective CONTRIBUTING.md to ensure reviews can happen promptly. Also, if you plan to do something more involved, please reach out to us and send an <a href='corona-warn-app.opensource...sap...com' title='' class='email'>email</a> first. This will avoid unnecessary work and give you and us a good deal of inspiration."
        },
        "content": {
            "subtitle": "If you are contributing for the first time, follow these guidelines:",
            "feature-list": [{
                "image": {
                    "title": "",
                    "url": "/assets/img/icons/issue.svg",
                    "alt": ""
                },
                "title": "To work on an issue",
                "text": "Claim it first by commenting on the GitHub issue that you want to work on."
            },{
                "image": {
                    "title": "",
                    "url": "/assets/img/icons/questions.svg",
                    "alt": ""
                },
                "title": "To ask a question",
                "text": "To clarify an issue, simply comment on it, and one of the maintainers will respond."
            },{
                "image": {
                    "title": "",
                    "url": "/assets/img/icons/documentation.svg",
                    "alt": ""
                },
                "title": "To contribute code or documentation",
                "text": "In order to fix a bug or to implement a new feature, contributions must be licensed under the <a href='https://github.com/corona-warn-app/cwa-documentation/blob/main/LICENSE' target='_blank' rel='noopener noreferrer'>Apache 2.0 License</a>."
            },{
                "image": {
                    "title": "",
                    "url": "/assets/img/icons/improvement.svg",
                    "alt": ""
                },
                "title": "To report a trivial fix or improvement",
                "text": "Create a pull request, addressing a suitable code owner of the particular repository (see for example the documentation repo's <a href='https://github.com/corona-warn-app/cwa-documentation/blob/main/CODEOWNERS' target='_blank' rel='noopener noreferrer' title=''>Code Owners</a>)."
            },{
                "image": {
                    "title": "",
                    "url": "/assets/img/icons/security.svg",
                    "alt": ""
                },
                "title": "To report a significant security risk",
                "text": "Make sure to follow the process outlined in the Security Policy that is accessible through the Security tab in each dev repository."
            }]
        },
        "text": "For any of the above, please make sure you provide as much info as you can. Please also make sure to consult the dedicated contribution guidelines of the respective repository.",
        "box": {
            "class": "wide",
            "image": {
                "url": "/assets/img/icons/improvement.svg",
                "title": "",
                "alt": ""
            },
            "content": {
                "title": "Want to give technically detailed feedback?",
                "text": "In the <a href='../faq' target='_blank'>FAQ</a> you will find answers to frequently asked questions as well as information on how to contact us with your particular request."
            }
        },
        "box2": {
            "class": "wide",
            "image": {
                "url": "/assets/img/ideas.svg",
                "title": "",
                "alt": ""
            },
            "content": {
                "title": "Want to do more?",
                "text": "In case you want to be involved even more, please send us an <a href='corona-warn-app.opensource...sap...com' target='_blank' class='email' rel='noopener noreferrer' title=''>email</a>. We're happy to see new ideas coming in!"
            }
        }
    },
    "section-start-contribute": {
        "headline": {
            "title": "Start contributing!",
            "button": {
                "title": "Take me to GitHub",
                "url": "https://github.com/corona-warn-app",
                "icon": "github",
                "external": true
            }
        }
    },
    "section-social-media": {
        "title": "Social Media",
        "anchor": "socialmedia",
        "textblock": ["You can also find the most important information about the Corona-Warn-App, its features and its development on social media. Note that these accounts only publish German content."],
        "socialmedia": [{
            "title": "Twitter",
            "textblock": ["The Corona-Warn-App has its own <a href='https://twitter.com/coronawarnapp' target='_blank' rel='noopener noreferrer'>Twitter-Account</a>. On Twitter, we regularly inform you about key figures, updates and new features. You can also participate in polls and discuss with other followers about the Corona-Warn-App.",
            "Follow the account, become a part of the Twitter community and help us to improve the app and make it better known."]
        },
        {
            "title": "Instagram",
            "textblock": ["At <a href='https://www.instagram.com/rki_fuer_euch/' target='_blank' rel='noopener noreferrer'>RKI für Euch</a> on Instagram we share interesting facts about the Robert Koch Institute, about the development of the pandemic and about the Corona-Warn-App."]
        }]
    }
}
