{
    "section-main": {
        "headline": {
            "title": "Get Started",
            "textblock": [
                "Welcome to the Corona-Warn-App community!",
                "If you are looking for information on how to join us, you have come to the right place. Read on to find out how you can get involved and contribute to Corona-Warn-App code and documentation.",
                "You can also <a href='#social-media'>follow us on Twitter and Instagram</a>, catch up on the latest developments and chat with other followers.",
                "Let's get started!"
            ]
        },
        "content": {
            "headline": {
                "title": "Contributing",
                "text": "Anyone can become a member of the project’s community. We encourage everyone interested to contribute and become part of our developer community. There are different ways for you to get involved."
            },
            "simple-list": {
                "image": {
                    "url": "/assets/img/community.svg",
                    "right": true,
                    "alt": "Community icon image"
                },
                "title": "Contribution rules",
                "text": "All members of the project community must abide by the Contributor Covenant, version 2.0. Only by respecting each other can we develop a productive, collaborative community. For our specific guidelines, read the <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODE_OF_CONDUCT.md' target='_blank' rel='noopener noreferrer' title=''>Code of Conduct</a>."
            }
        }
    },
    "section-contribute-listing": {
        "headline": {
            "title": "Get involved",
            "subtitle": "You can submit a pull request in GitHub",
            "text": "As a general rule for any contribution: please make sure you provide as much information as you can to ease collaboration and follow the instructions noted in the CONTRIBUTING.md file of the repository you plan to contribute to. When creating a pull request, follow the Pull Request Checklist available in the respective CONTRIBUTING.md to ensure reviews can happen promptly. Also, if you plan to do something more involved, please reach out to us and send an <a href='corona-warn-app.opensource...sap...com' title='' class='email'>email</a> first. This will avoid unnecessary work and give you and us a good deal of inspiration."
        },
        "content": {
            "subtitle": "If you are contributing for the first time, follow these guidelines:",
            "feature-list": [{
                "image": {
                    "title": "Issue",
                    "url": "/assets/img/icons/issue.svg",
                    "alt": "Issue icon"
                },
                "title": "To work on an issue",
                "text": "Claim it first by commenting on the GitHub issue that you want to work on."
            },{
                "image": {
                    "title": "Questions",
                    "url": "/assets/img/icons/questions.svg",
                    "alt": "Questions icon"
                },
                "title": "To ask a question",
                "text": "To clarify an issue, simply comment on it, and one of the maintainers will respond."
            },{
                "image": {
                    "title": "Documentation",
                    "url": "/assets/img/icons/documentation.svg",
                    "alt": "Documentation icon"
                },
                "title": "To contribute code or documentation",
                "text": "In order to fix a bug or to implement a new feature, contributions must be licensed under the <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/LICENSE' target='_blank' rel='noopener noreferrer'>Apache 2.0 License</a>."
            },{
                "image": {
                    "title": "Improvement",
                    "url": "/assets/img/icons/improvement.svg",
                    "alt": "Improvement icon"
                },
                "title": "To report a trivial fix or improvement",
                "text": "Create a pull request, addressing a suitable code owner of the particular repository (see for example the documentation repo's <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODEOWNERS' target='_blank' rel='noopener noreferrer' title=''>Code Owners</a>)."
            },{
                "image": {
                    "title": "Security",
                    "url": "/assets/img/icons/security.svg",
                    "alt": "Security icon"
                },
                "title": "To report a significant security risk",
                "text": "Make sure to follow the process outlined in the Security Policy that is accessible through the Security tab in each dev repository."
            }]
        },
        "text": "For any of the above, please make sure you provide as much info as you can. Please also make sure to consult the dedicated contribution guidelines of the respective repository.",
        "box": {
            "class": "wide",
            "image": {
                "url": "/assets/img/ideas.svg",
                "title": "Ideas",
                "alt": "Ideas icon image"
            },
            "content": {
                "title": "Want to do more?",
                "text": "In case you want to be involved even more, please send us an <a href='corona-warn-app.opensource...sap...com' target='_blank' class='email' rel='noopener noreferrer' title=''>email</a>. We're happy to see new ideas coming in!"
            }
        }
    },
    "section-start-contribute": {
        "headline": {
            "title": "Start contributing!",
            "button": {
                "title": "Take me to GitHub",
                "url": "https://github.com/corona-warn-app",
                "icon": "github",
                "external": true
            }
        }
    },
    "section-social-media": {
        "title": "Social Media",
        "anchor": "social-media",
        "textblock": ["You can also find the most important information about the Corona-Warn-App, its features and its development on social media."],
        "socialmedia": [{
            "title": "Twitter",
            "textblock": ["The Corona-Warn-App has its own <a href='https://twitter.com/coronawarnapp' target='_blank'>Twitter-Account</a>. On Twitter, we regularly inform you about key figures, updates and new features. You can also participate in polls and discuss with other followers about the Corona-Warn-App.",
            "Follow the account, become a part of the Twitter community and help us to make the app even more known and better."]
        },
        {
            "title": "Instagram",
            "textblock": ["At <a href='https://www.instagram.com/rki_fuer_euch/' target='_blank'>RKI für Euch</a> on Instagram we share interesting facts about the Robert Koch Institute, about the development of the pandemic and about the Corona-Warn-App."]
        }]
    }
}
