{
    "section-main": {
        "headline": {
            "title": "Häufig gestellte Fragen zum Corona-Warn-App Projekt"
        },
        "sections": [{
            "title": "Allgemeines",
            "active": true,
            "id": "general",
            "accordion": [
                {
                    "active": true,
                    "title": "Wann ist die App fertig? ",
                    "textblock": [
                      "Wir arbeiten mit Hochdruck an der Fertigstellung der Applikation. Habt bitte Verständnis dafür, dass wir hier keinen genauen Zeitpunkt nennen können. Wendet Euch hierzu bitte an das zuständige Bundesministerium. Der Entwicklungsfortschritt kann allerdings im Code-Repository verfolgt werden."  
                    ]
                },{
                    "title" : "Kann ich Informationen finden, Fragen stellen oder Themen diskutieren, bei denen es um die Corona-Warn-App geht, die aber nicht entwicklungsbezogen sind? ",
                    "textblock": [
                        "Im Open-Source-Projekt für die Corona-Warn-App und auf der zugehörigen Website coronawarn.app geht es um die Open-Source-Entwicklung der App. Die Website und die GitHub Repositories sind nur für Themen im Zusammenhang mit der App-Entwicklung gedacht, nicht für Informationen zu anderen Themen, wie rechtliche Fragen, Informationen für den Nutzer usw."
                    ]
                }
            ]
        },{
            "title": "Open Source",
            "id": "open-source",
            "accordion": [
                {
                    "title": "Warum verfolgen wir einen Open-Source-Ansatz? ",
                    "textblock": [
                        "Wir sind der Auffassung, dass der Erfolg der Lösung unmittelbar von der Akzeptanz und dem Vertrauen der Nutzer abhängt. Durch den gewählten Open-Source-Ansatz möchten wir die für eine starke Vertrauensbasis notwendige Transparenz schaffen. Durch Open Source haben die Öffentlichkeit und die Entwicklungscommunity darüber hinaus die Möglichkeit, aktiv zu dem Erfolg der Lösung beizutragen, z.B. in Form von Reviews und Pull Requests."
                    ]
                },
                {
                    "title": "Wie können Entwickler zum Projekt beitragen? ",
                    "textblock": [
                        "Das Open Source Project verwendet GitHub, einem in dem Bereich weltbekannten Onlinedienst, der Software-Entwicklungsprojekte auf seinen Servern bereitstellt. Dort können sich alle Interessierten am Projekt beteiligen, bspw. durch das Beheben von Fehlern im Code, bei der Dokumentation oder durch das Einbringen von Fragen und Kommentaren zum Projekt. Die Zusammenarbeit innerhalb der Community unterliegt einem Code of Conduct. Alle Richtlinien zur Beteiligung findest du <a href='./community'>hier</a>."
                    ]
                },
                {
                    "title": "Warum GitHub und nicht eine andere Plattform? ",
                    "textblock": [
                        "Wir sind der Auffassung das GitHub eine stark etablierte und entsprechend respektierte Plattform für Open-Source-Projekte ist. GitHub ist die weltweit größte Open-Source-Plattform mit über 40 Millionen BenutzerInnen und mehr als 100 Millionen Repositories, davon >30 Millionen öffentlich zugänglich.<br>Wenn jemand keinen GitHub Account erstellen möchte, gibt es auch ohne Account die Möglichkeit den Code einzusehen."
                    ]
                },{
                    "title": "Welcher Code of Conduct ist maßgebend?",
                    "textblock": [
                        "Nur in gegenseitigem Respekt ist eine erfolgreiche Entwicklung in einer produktiven, kollaborierenden Community möglich. Alle Mitglieder der Projektcommunity befolgen deshalb einen <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODE_OF_CONDUCT.md' target='_blank' title=''>code of conduct</a>. Verstöße gegen den Code of Conduct können von allen Mitgliedern der Community an die Projektverantwortlichen oder an <a href='mailto:corona-warn-app.opensource@sap.com 'target='_blank'>corona-warn-app.opensource@sap.com</a> gemeldet werden und Konsequenzen wie Verwarnung oder Ausschluss nach sich ziehen.  "
                    ]
                }
            ]
        },{
            "title": "Applikation",
            "id": "application",
            "accordion": [
                {
                    "title": "Wird die Smartphone-Batterie nicht schnell leerlaufen mit der App im Hintergrund?",
                    "textblock": [
                        "The Corona Warn app uses the existing Bluetooth technology on user devices.<br>Thanks to incorporation of the Exposure Notification API from Apple and Google, the app can use the energy-efficient BLE (Bluetooth Low Energy) technology."
					]
                },
                {
                    "title": "Wird die App auch auf alternativen Plattformen zu App Store und Google Play Store zur Verfügung gestellt?  ",
                    "textblock": [
                        "Wir beabsichtigen nicht, die App in andere App Stores außer denen von Google oder Apple zur Verfügung zu stellen.<be>Die App wird die Apple und Google Exposure Notification APIs verwenden. Die Community sich gerne einbringen und sie für andere APIs übernehmen."
                    ]
                },
                {
                    "title": "Wie wird sich der Stand in GitHub auf die App in den App Stores übertragen?",
                    "textblock": [
                        "Die App wird über Standardwerkzeuge (z.B. Xcode, Android Studio) erstellt und dann in die jeweiligen App Stores hochgeladen. <a href='https://core.telegram.org/reproducible-builds 'target='_blank'>Diese Anleitung</a> gibt Hilfestellung zur Verifizierung, dass der Code in GitHub wirklich mit der App in den jeweiligen App Stores übereinstimmt."
                    ]
                }
            ]
        },{
            "title": "Technologies",
            "id": "technologies",
            "accordion": [
                {
                    "title": "Ist ein datenschutzkonformer Umgang mit den Nutzerdaten möglich?",
                    "textblock": [
                        "Die dezentrale Datenspeicherung auf den Geräten garantieren Datenschutz.",
						"Wir arbeiten sehr eng mit Experten aus der Datenschutzcommunity zusammen und stimmen uns während des Entwicklungsprozesses eng miteinander ab. Zudem arbeiten wir an einem dedizierten Dokument zur Datensicherheit, das schon bald publiziert werden soll.",
						"Die Quelloffenheit des Codes sorgt zudem dafür, dass die Community die Funktionsweise der App überprüfen und Anmerkungen abgeben kann."
                    ]
                },
                {
                    "title": "Was wird genau gespeichert und wer kann auf die über Bluetooth gesammelten Daten zugreifen?",
                    "textblock": [
                        "Über Bluetooth werden konstant wechselnde IDs versendet und von den Geräten gesammelt, die die App installiert haben. Es erfolgt kein Versand und keine Speicherung von personenbezogenen Daten sowie Geolokations- oder sonstigen ortsbezogenen Daten.",
						"Mit Hilfe der Exposure Notification API von Google und Apple verbleiben die IDs in einem gesichertem Bereich des Betriebssystems des Handys.  Der Abgleich, ob man einer infizierten Person begegnet ist, geschieht lokal auf dem Handy. Es verlassen keine Daten zum „Matching“ (Abgleich) das Handy.",
						"Sobald der Nutzer positiv getestet wurde, wird er gebeten, seine Temporary Exposure Keys der letzten 14 Tage zu teilen. Der Zugriff auf diese Schlüssel erfolgt über die Exposure Notification API, allerdings nur dann, wenn der Nutzer aktiv seine Zustimmung gegeben hat."
                    ]
                },
                {
                    "title": "Ist das Offenlegen vom Quellcode mit diesem Open-Source-Ansatz keine Gefahr für die Cybersecurity?",
                    "textblock": [
                        "Im Gegenteil: Die Open-Source-Community erhöht die Sicherheit der Software, da der Quellcode offen liegt und jeder Interessierte den Code herunterladen und Zeile für Zeile überprüfen kann.",
						"Wir glauben daran, dass Sicherheit nicht durch Intransparenz gewährleistet wird. Deshalb verfolgen wir einen Open-Source-Ansatz."
                    ]
                }
            ]
        }]
    }
}
