{
    "section-main": {
        "headline": {
            "title": "Häufig gestellte Fragen zur Corona-Warn-App"
        },
        "texts": {
            "permalink": "Link zu dieser Antwort",
            "search": "Suche",
            "questions": "Fragen",
            "to_top": "Zum Anfang"
        },
        "sections": [
            {
                "title": "Support",
                "id": "support",
                "active": true,
                "accordion": [
                   {
                        "title": "Wer hilft bei Fragen zur Corona-Warn-App?",
                        "anchor": "who_can_help",
                        "active": true,
                        "textblock": [
                            "Die technische Hotline (Telefon 0800 7540001) hilft Ihnen bei technischen Fragen rund um die Corona-Warn-App, zum Beispiel bei Problemen mit der Risiko-Ermittlung. Sie erreichen sie von Montag bis Samstag von 7 bis 22 Uhr (außer an bundesweiten Feiertagen), und sie ist für Sie innerhalb Deutschlands kostenfrei.",
                            "Die TAN-Hotline (Telefon 0800 7540002) hilft Ihnen bei der Eingabe der TAN, wenn Sie ein positives Testergebnis haben, und wenn Sie keine TAN oder kein Dokument mit QR-Code erhalten haben. Die Hotline ist 24 Stunden täglich an sieben Tagen in der Woche erreichbar. Der Anruf ist kostenfrei.",
                            "Falls das Testergebnis nicht in der Corona-Warn-App abrufbar ist, sollte das zuständige Fachpersonal, Testcenter oder Gesundheitsamt kontaktiert werden, um das Testergebnis zu erhalten. <br/>Um Ihnen die Suche nach dem zuständigen Gesundheitsamt zu erleichtern, hat das RKI eine entsprechendes Tool zur Verfügung gestellt. Durch die Angabe der Postleitzahl oder des Wohnortes, wird sofort das zuständige Gesundheitsamt inklusive der Kontaktdaten angezeigt: <a href='https://tools.rki.de/PLZTool'>Robert-Koch-Institut Tool: Gesundheitsamt nach Postleitzahl oder Ort</a> <br/><a href='https://www.coronawarn.app/de/blog/2020-08-25-notes-qr-codes/'>Weitere Hinweise zum QR-Code Verfahren</a>",
                            "Die Webseiten der Bundesregierung bieten allgemeine Informationen und Videos: <a href='https://www.bundesregierung.de/breg-de/themen/corona-warn-app'>https://www.bundesregierung.de/breg-de/themen/corona-warn-app</a>.",
                            "Das Robert-Koch-Institut stellt auch Informationen zu epidemiologischen Aspekten zur Verfügung: <a href='https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/nCoV_node.html'>https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/nCoV_node.html</a>.",
                            "Als Medienvertreter richten Sie bitte Ihre Anfragen an <a href='mailto:press@sap.com'>press@sap.com</a>.",
                            "Die verschiedenen Feedback-Kanäle der <a href='https://www.coronawarn.app/de/community/'>Corona-Warn-App-Community<a/> helfen Ihnen bei Fragen zum Open Source Projekt der Corona-Warn-App."
                        ]
                    }
                ]
            },
            {
                "title": "Häufige Probleme",
                "id": "most_asked",
                "accordion": [
                    {
                        "title": "[Google/Android]: Batterieoptimierung wird nicht automatisch abgeschaltet nachdem die priorisierte Hintergrundaktivität aktiviert wurde",
                        "anchor": "battery_optimization_background",
                        "active": true,
                        "textblock": [
                             "Wenn Sie die priorisierte Hintergrundaktivität auf einigen Android-Geräten einschalten, wird die Batterieoptimierung für die Corona-Warn-App auf Betriebssystemebene nicht ausgeschaltet. Dies ist eine bekannte Einschränkung für eine begrenzte Anzahl von Android-Geräten. Um die Batterieoptimierung entsprechend zu deaktivieren, starten Sie Ihr Gerät neu."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Die Risikoermittlung lässt sich nach dem Update auf iOS 14 nicht mehr aktivieren",
                        "anchor": "no_risk_update_ios14",
                        "active": true,
                        "textblock": [
                             "Nach dem Update auf iOS 14 melden einige Nutzer, dass die Risikoermittlung deaktiviert wurde und nicht mehr eingeschaltet werden kann.",
                             "Dieses Problem ist bereits der Entwicklung gemeldet und sie arbeiten an einer Lösung. Um die App bis zur Behebung des Fehlers in vollem Umfang nutzen zu können, gehen Sie bitte wie folgt vor:",
                             "'Einstellungen' > 'WLAN' > 'WLAN' ausschalten.",
                             "'Einstellungen' > 'Begegnungsmitteilungen' > 'Aktive Region' (Corona-Warn-App) > 'Corona-Warn-App' > 'Begegnungsinformationen teilen' einmal aus- und wieder einschalten.",
                             "'Einstellungen' > 'WLAN' > 'WLAN' wieder einschalten.",
                             "Wenn der Fehler weiterhin auftritt, obwohl Sie alle Schritte ausgeführt haben, müssen Sie die Anwendung 1x zurücksetzen und neu installieren. Ihre gesammelten Zufalls-IDs gehen dabei nicht verloren (<a href='#delete_random_ids'>siehe auch hier</a>). Es dauert jedoch 24 Stunden bis die App wieder auf die bisher gesammelten Daten zurückgreift."
                        ]
                    },
                    {
                        "title": "[Apple/iOS] Leerer Bildschirm auf iOS 13.7 / 14",
                        "anchor": "ios_black_screen",
                        "active": true,
                        "textblock": [
                            "Es gibt ein bekanntes Problem unter iOS 13.7 / 14 wo es in seltenen Fällen vorkommen kann dass sich die Begegnungsmitteilungen nach einem Update nicht mehr aktivieren lassen. Das Resultat ist ein schwarzer Bildschirm in den iOS Einstellungen.",
                            "Um das Problem zu beheben gehen Sie wie folgt vor:",
                            "Einstellungen > Allgemein > Zurücksetzen > Standort und Datenschutz",
                            "Im Anschluss müssen die Berechtigungen in der Corona-Warn App erneut vergeben werden. Dazu werden Sie beim Start der App aufgefordert."
                        ]
                    },
                    {
                        "title": "Ich habe eine Risiko-Begegnung, mir wird aber nach wie vor ein niedriges Risiko angezeigt",
                        "anchor": "encounter_but_green",
                        "active": true,
                        "textblock": [
                            "Alle aktiven Corona-Warn-Apps laden regelmäßig die veröffentlichten Positivkennungen vom Corona-Warn-App-Server herunter und übergeben sie gesammelt über eine Schnittstelle an das Betriebssystem. Dort wird geprüft, ob empfangene und aufgezeichnete Zufalls-IDs vorliegen, die zu einer der Positivkennungen passen. Passen sie zusammen, heißt das Folgendes: Ihr Smartphone, das die Zufalls-IDs aufgezeichnet hat, und das Smartphone der Person die anschließend Corona-positiv getestet wurde, sind sich begegnet.",
                            "Als Nächstes wird für jede Positivkennung anhand aller dazu passenden Zufalls-IDs geschätzt, wie lange die Begegnungen jenes Tags insgesamt gedauert haben und wie nahe die Smartphones sich dabei im Durchschnitt waren. Die Entfernung wird aus der gemessenen Abschwächung des Bluetooth-Signals errechnet, die in dB (Dezibel) angegeben wird. Jedem dB-Wert lässt sich eine Entfernung im Freiraum (d.h. ohne Hindernisse im Signalweg) zuordnen. Alle Begegnungen zu einer Positivkennung, die insgesamt weniger als 10 Minuten gedauert haben (egal, wie nahe sich die Smartphones dabei gekommen sind) oder bei denen die Smartphones im Durchschnitt mehr als ca. 8 Meter Freiraum (73 dB Dämpfung) voneinander entfernt waren (egal, wie lange sie insgesamt gedauert haben), werden als unbedenklich bewertet.",
                            "Die verbleibenden Begegnungen werden in ihrer Gesamtheit unter Berücksichtigung ihres Abstands und ihrer Dauer sowie der vermutlichen Infektiosität der anderen Person(en) bewertet. Nicht immer ergibt diese Bewertung ein erhöhtes Risiko, in diesem Fall werden diese Begegnungen - zusammen mit den oben genannten harmlosen Begegnungen - in der Corona-Warn-App angezeigt aber die Risikobewertung ändert sich nicht.",
                            "Weitere Details zur Risiko-Ermittlung mit einer Beispielrechnung finden Sie unter <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/translations/cwa-risk-assessment.de.md' target='_blank' rel='noopener noreferrer'>https://github.com/corona-warn-app/cwa-documentation/blob/master/translations/cwa-risk-assessment.de.md</a>."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Beim Einschalten der Risiko-Ermittlung bzw. von Bluetooth bekomme ich Meldungen zur Aktivierung der Standortverwendung. Muss ich das aktivieren?",
                        "anchor": "android_location",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/> Wenn Sie Android 11 und die Corona-Warn-App ab Version 1.5 benutzen, müssen Sie die Standortverwendung nicht mehr aktivieren, um die Corona-Warn-App zu nutzen. Diese für Android Version 11 nicht zutreffende Benachrichtigung wird in einem der nächsten Updates der Corona-Warn-App entfernt.<hr/>",
                            "Die Corona-Warn-App fragt Ihren Standort nicht ab und hat auch keine Berechtigung zur Standortabfrage. Die Meldung geht auf eine Besonderheit von Android zurück: Bluetooth-Geräte in Ihrer Nähe können grundsätzlich nur gefunden werden, wenn die Standortverwendung allgemein auf Ihrem Gerät aktiviert ist (siehe <a href='https://support.google.com/android/answer/9888358?hl=de' target='_blank' rel='noopener noreferrer'>COVID-19-Benachrichtigungen auf Ihrem Android-Smartphone aktivieren</a> und <a href='https://support.google.com/android/answer/9930236?hl=de' target='_blank' rel='noopener noreferrer'>COVID-19-Benachrichtigungssystem und Android-Standorteinstellungen</a> in der Android-Hilfe sowie <a href='https://developer.android.com/guide/topics/connectivity/bluetooth' target='_blank' rel='noopener noreferrer'>Bluetooth Overview</a> in der Android-Entwicklerdokumentation). Das bedeutet aber nicht, dass Apps, die Bluetooth nutzen, auch automatisch Ihren Standort erfassen.",
                            "Da die Corona-Warn-App Geräte in Ihrer Nähe über Bluetooth erkennt, muss die allgemeine Systemeinstellung 'Standort verwenden' als Voraussetzung aktiviert sein. Allerdings wird die App zu keiner Zeit Ihren Standort erfassen oder GPS verwenden. Sie können das gerne selbst folgendermaßen nachprüfen:",
                            "<ol><li>Öffnen Sie die Einstellungen Ihres Smartphones (nicht die Einstellungen in der App!).</li><li>Wählen Sie 'Sicherheit & Standort' > 'Standort' > 'Berechtigungen auf App-Ebene'.</li><li>Sehen Sie sich die Liste der Apps an, die auf Ihren Standort zugreifen können, wenn Sie es zulassen. Sie sehen: Die Corona-Warn-App ist nicht aufgeführt.</li></ol>",
                            "An dieser Stelle könnten Sie anderen Apps die Berechtigung für den Standortzugriff erteilen oder entziehen, aber da die Corona-Warn-App diese Berechtigung nicht braucht, ist sie auch nicht aufgeführt.",
                            "Hinweis: Wie oben beschrieben: Aktivieren Sie die allgemeine Systemeinstellung 'Standort verwenden' unter 'Einstellungen' > 'Sicherheit & Standort' > 'Standort', da sonst der Austausch der verschlüsselten Zufalls-IDs zur Risiko-Ermittlung nicht funktioniert."
                        ]
                    },
                    {
                        "title": "Probleme mit dem QR-Code",
                        "anchor": "qr_test",
                        "active": true,
                        "textblock": [
                            "Ich habe im Rahmen eines Tests einen QR-Code erhalten, den ich zum Abruf des Testergebnisses über die Corona-Warn-App nutzen möchte. Beim Einscannen erhalte ich einen Fehler oder aber das Testergebnis konnte über Tage nicht abgerufen werden. Was kann ich tun?",
                            "In einigen Fällen kann es vorkommen, dass Sie einen QR-Code erhalten haben, der nicht mit dem Testabrufsystem der Corona-Warn-App kompatibel ist bzw. nicht für den Abruf des Tests freigeschaltet wurde. Um diese Probleme auszuschließen, erkundigen Sie sich bitte, ob a) das Labor, mit dem der Arzt oder das Testcenter zusammenarbeiten an die Corona-Warn-App angebunden ist und b) das Feld 9 'Einverständnis des Versicherten zum Übermitteln des Testergebnisses für Zwecke der Corona-Warn-App' angekreuzt wurde. Nur dann ist sichergestellt, dass das genutzte Verfahren mit der Corona-Warn-App funktioniert.",
                            "Sofern Sie nach einem Corona-Test Ihren QR-Code in die App eingescannt haben und innerhalb von wenigen Tagen kein Testergebnis über die App mitgeteilt bekommen, könnte es sein, dass das entsprechende Labor noch nicht vollständig mit der Corona-Warn-App zusammenarbeitet. Derzeit sind 70-80% der vorhandenen Testkapazitäten in Deutschland durch den kompletten digitalen Prozess abgedeckt. Wir arbeiten mit den Laboren weiter daran, die Lücken zu schließen und alle Labore für den Prozess anzubinden und aufzurüsten. Deshalb kann es vorkommen, dass ein Labor zwar die Beauftragung für den Test mit dem richtigen Formular bekommt, das Testergebnis aber auf einem anderen Weg an die getestete Person übermitteln muss. Rufen Sie dann bitte beim zuständigen ärztlichen Fachpersonal bzw. Testcenter/Gesundheitsamt an, um Ihr Testergebnis zu erhalten. Wird Ihnen dabei ein positives Testergebnis mitgeteilt und möchten Sie über die Corona-Warn-App Ihre Risikobegegnungen warnen, rufen Sie die Hotline unter der +49 800 7540002 an und nehmen Sie am TeleTan-Verfahren teil.",
                            "Wenn Sie den QR Code bereits gescannt haben, kann dieser leider nicht ein zweites Mal gescannt werden, ebenso ist das Löschen eines zuvor eingegebenen QR Codes und erneutes einscannen nicht möglich. Wir müssen sicherstellen, dass nur ein Telefon den QR Code scannen und seine Diagnoseschlüssel übermitteln kann. Aus Datenschutzgründen können wir die ID des Telefons nicht speichern, deshalb ist der QR Code nur für einen Scan gültig.",
                            "Wir prüfen gerade, wie die Verbesserung der Benutzerschnittstelle der App verbessert werden kann, um nicht funktionierende QR-Codes zu erkennen und Sie darüber informieren zu können. Weitere Details zu den Fehlern finden Sie <a href='https://github.com/corona-warn-app/cwa-documentation/issues/400' target='_blank' rel='noopener noreferrer'>auf GitHub</a>."
                        ]
                    },
                    {
                        "title": "Wird mein Smartphone-Akku nicht schnell leerlaufen mit der App im Hintergrund?",
                        "anchor": "battery",
                        "active": true,
                        "textblock": [
                            "Die Corona-Warn-App nutzt die vorhandene Bluetooth-Technologie der Endgeräte. Da die App die Exposure Notification API von Apple und Google verwendet, unterstützt sie die energieeffiziente Bluetooth-Technologie BLE (Bluetooth Low Energy).",
                            "Der Akkuverbrauch der Corona-Warn-App teilt sich in zwei Faktoren: Den Verbrauch der App selbst und den Verbrauch aufgrund der Aufzeichnung der Begegnungen über das Exposure Notification System. Letzteres kann durch die Nutzung der jeweils aktuell verfügbaren Betriebssysteme für iOS und Android optimiert werden.",
                            "Bitte beachten Sie bei der Interpretation Ihres Akkuverbrauchs, dass sich die Prozentangabe auf die vollständige Nutzung Ihres Telefons in den letzten 24 Stunden bezieht. Das bedeutet, dass ein häufig und intensiv genutztes Telefon einen sehr geringen Prozentsatz pro App aufweist. Wenn Sie ihr Telefon hauptsächlich zum Telefonieren nutzen und nur gelegentlich Musik streamen oder soziale Medien nutzen, wird der Anteil pro App hingegen relativ hoch sein.",
                            "<b>Besonderheit bei Android</b>: Bluetooth-Geräte in Ihrer Nähe können grundsätzlich nur gefunden werden, wenn die Standortverwendung auf dem Gerät allgemein aktiviert ist (Details siehe <a href='#android_location' target='_blank' rel='noopener'>Android: Beim Einschalten der Risiko-Ermittlung bzw. von Bluetooth bekomme ich Meldungen zur Aktivierung der Standortverwendung. Muss ich das aktivieren?</a>). Damit könnten auch andere Apps auf Ihrem Gerät die Standortdienste nutzen, was ein Grund für den erhöhten Stromverbrauch sein kann. Um dies zu umgehen, sollten Sie prüfen, welche Apps tatsächlich Ihren Standort nutzen. Dazu öffnen Sie die Geräte-Einstellungen und wählen 'Sicherheit & Standort' > 'Standort' > 'Berechtigungen auf App-Ebene'. Hier können Sie den installierten Apps die Berechtigung für den Standortzugriff entziehen, wenn diese nicht benötigt wird. Die Corona-Warn-App greift nicht auf Ihren Standort zu, deshalb ist sie nicht aufgeführt."
                        ]
                    }
                ]
            },
            {
                "title": "Hintergrund&shy;aktualisierung",
                "id": "background_updates",
                "accordion": [
                   {
                        "title": "[Apple/iOS]: Mein Risikostatus wurde seit über einem Tag nicht mehr aktualisiert. Internet war aber verfügbar, was läuft hier falsch?",
                        "anchor": "no_risk_update_ios",
                        "active": true,
                        "textblock": [
                            "Zuerst stellen Sie bitte sicher,  dass die neuesten Versionen von iOS und der App installiert sind. Die aktuellste iOS Version der Corona Warn App ist aktuell <b>[ios.current-app-version]</b>. Wenn eine niedrigere Version installiert ist, öffnen Sie den App Store, um herauszufinden, ob es Updates für die Corona-Warn-App gibt. Installieren Sie dann das Update. Um weitere Probleme auszuschließen, kann nach dem Update auch ein Neustart des Geräts helfen. Öffnen Sie nach einem Neustart die Corona-Warn-App. Weitere Informationen zum Thema finden Sie <a href='https://www.linkedin.com/pulse/corona-warn-app-software-update-f%25C3%25BCr-ios-harald-lindlar/' target='_blank' rel='noopener noreferrer'>in einem Blogpost auf LinkedIn</a>.",
                            "Stellen Sie sicher, dass die Risiko-Ermittlung aktiv ist.",
                            "Wenn das Problem mit der neuesten Version immer noch auftritt, öffnen Sie bitte regelmäßig die App, mindestens einmal pro Tag. Wir arbeiten an weiteren Updates zur Lösung entsprechender Probleme.",
                            "Bitte überprüfen Sie zusätzlich die folgenden Einstellungen Ihres Smartphones:",
                            "<b>Hintergrundaktualisierung (allgemein)</b>",
                            "Wichtig ist, dass Sie grundsätzlich die Hintergrundaktualisierung per WLAN und mobile Daten zulassen. Dazu wählen Sie in den Geräte-Einstellungen 'Allgemein' > 'Hintergrundaktualisierung' und aktivieren die Hintergrundaktualisierung für 'WLAN & Mobile Daten'.",
                            "Damit lassen Sie grundsätzlich zu, dass Apps im Hintergrund Aktualisierungen empfangen können. Welche Apps das tatsächlich tun, können Sie aber für jede App einzeln entscheiden (siehe nächster Schritt).",
                            "<i>Wichtig: Die mobilen Daten, die bei der Verwendung der Corona-Warn-App übertragen werden, kosten Sie keinen Cent und werden nicht von Ihrem vertraglichen Datenvolumen o. ä. abgezogen.</i>",
                            "<b>Hintergrundaktualisierung der Corona-Warn-App</b>",
                            "Bitte prüfen Sie, ob die Hintergrundaktualisierung auch für die Corona-Warn-App selbst ausdrücklich erlaubt ist. Dazu öffnen Sie auch die Geräte-Einstellungen, wählen 'Corona-Warn' und aktivieren die Optionen 'Hintergrundaktualisierung' und 'Mobile Daten'. Wie oben erwähnt: Sie bezahlen nichts für die mobilen Daten, die über die App übermittelt werden."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Mein Risikostatus wurde seit über einem Tag nicht mehr aktualisiert. Internet war aber verfügbar, was läuft hier falsch?",
                        "anchor": "no_risk_update",
                        "active": true,
                        "textblock": [
                            "Zuerst stellen Sie bitte sicher, dass die neueste Version der App installiert ist. Sie sollten mindestens Version [android.current-app-version] verwenden. Wenn eine niedrigere Version installiert ist, öffnen Sie den Google Play Store, um herauszufinden, ob es Updates für die Corona-Warn-App gibt. Installieren Sie dann das Update. Um weitere Probleme auszuschließen, kann nach dem Update auch ein Neustart des Geräts helfen. Öffnen Sie nach einem Neustart die Corona-Warn-App. Weitere Informationen zum Thema finden Sie <a href='https://www.linkedin.com/pulse/corona-warn-app-software-update-f%25C3%25BCr-ios-harald-lindlar/' target='_blank' rel='noopener noreferrer'>in einem Blogpost auf LinkedIn</a>.",
                            "Stellen Sie sicher, dass die Risiko-Ermittlung aktiv ist.",
                            "Falls das Problem auch in der neuesten Version auftritt, ist es in der Regel auf einzelne Energiesparmodi bzw. Akkueinstellungen verschiedener Hersteller zurückzuführen. Diese halten sich nicht vollständig an die Android-Spezifikation und sparen oft zu aggressiv Energie. <b>Die Corona-Warn-App ist von diesen Energiespar-Einstellungen betroffen und kann deswegen oft längere Zeit den Risikostatus nicht im Hintergrund aktualisieren. Sollte das der Fall sein, können Sie diese Einstellung in der Corona-Warn-App ändern:</b>",
                            "<ol><li>Öffnen Sie die Einstellungen der App.</li><li>Wählen Sie 'Priorisierte Hintergrundaktivität'.</li><li>Aktivieren Sie die priorisierte Hintergrundaktivität und lassen Sie die vorgeschlagene Änderung zu.</li></ol>",
                            "Samsung bietet für ihre Geräte zusätzlich einen sogenannten \"Ultra-Energiesparmodus\" an. Dieser verhindert oft eine erfolgreiche Hintergrundaktualisierung, selbst wenn 'Priorisierte Hintergrundaktivität' aktiviert ist. <b>Für eine ordnungsgemäße Funktion der Corona-Warn-App sollte der Ultra-Energiesparmodus daher ausgeschaltet sein.</b> Beachten Sie dazu die <a href='#max_power_save' target='_blank' rel='noopener'>Hinweise zum Ultra-Energiesparmodus auf Samsung-Geräten</a>.",
                            "Sie können in den Energiespar-Einstellungen Ihres Smartphones sicherstellen, dass für die Corona-Warn-App eine Ausnahme vom Energiesparen festgelegt ist:",
                            "Leider kann es sein, dass Sie bei einigen Smartphones die priorisierte Hintergrundaktivität nicht in den Einstellungen in der App einschalten können. Sie können die priorisierte Hintergrundaktivität dennoch aktivieren: Das machen Sie direkt in den Energiespar-Einstellungen Ihres Smartphones. Legen Sie dort eine Ausnahme für die Corona-Warn-App fest. Sollte dies immer noch nicht dazu führen, dass der Risikostatus automatisch im Hintergrund aktualisiert wird, schreiben Sie uns bitte einen Kommentar mit dem Smartphone-Typ und der installierten Version der App und der COVID-19-Benachrichtigungen in das <a href='https://github.com/corona-warn-app/cwa-app-android/issues/933' target='_blank' rel='noopener noreferrer'>GitHub-Issue 933</a>.",
                            "Wenn mit der neuesten Version das Problem immer noch auftritt, öffnen Sie bitte regelmäßig die App, mindestens einmal pro Tag.",
                            "Für den Fall, dass all diese Hinweise nicht den gewünschten Effekt hatten, können Sie weitere, gerätespezifische, Einstellungen vornehmen. Software-Hersteller, wie etwa Slack, bei denen die gleichen Probleme auftreten, haben deswegen bereits sehr viele Informationen zur Lösung bereitgestellt. Versuchen Sie deshalb bitte, die Tipps aus der Slack-Dokumentation für die Corona-Warn-App und Ihr Smartphone anzuwenden: <a href='https://slack.com/intl/de-de/help/articles/360001562747-Bekannte-Probleme-mit-Android%E2%80%91Benachrichtigungen' target='_blank' rel='noopener noreferrer'>Bekannte Probleme mit Android-Benachrichtigungen</a>. Besitzen Sie ein <a href='#huawei_honor' target='_blank' rel='noopener'>Huawei- oder Honor-Smartphone, beachten Sie bitte auch diese Hinweise</a>."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Hinweise zum Ultra-Energiesparmodus auf Samsung-Geräten",
                        "anchor": "max_power_save",
                        "active": true,
                        "textblock": [
                            "Bei Benutzung des Ultra-Energiesparmodus auf Geräten von Samsung kann die Hintergrundaktualisierung trotz <a href='#no_risk_update' target='_blank' rel='noopener'>Einschalten der priorisierten Hintergrundaktivität</a> fehlschlagen. Grund dafür ist wahrscheinlich, dass der Aktualisierungsprozess aufgrund der stark reduzierten Rechenleistung abgebrochen wird. Der Ultra-Energiesparmodus sollte deshalb in den Einstellungen deaktiviert werden:",
                            "<ol><li>'Einstellungen' -> 'System' -> 'Energiesparmodus'</li><li>Wählen Sie 'Ultra-Energiesparmodus'.</li><li>Öffnen Sie das Menü in der oberen rechten Ecke und wählen Sie 'Ultra-Energiesparmodus deaktivieren'.</li></ol>"
                         ]
                    },
                    {
                        "title": "[Google/Android]: Hinweise zu Geräten von Huawei oder Honor",
                        "anchor": "huawei_honor",
                        "active": true,
                        "textblock": [
                            "Für Geräte von Huawei oder Honor können neben dem <a href='#no_risk_update' target='_blank' rel='noopener'>Einschalten der priorisierten Hintergrundaktivität</a> zusätzliche Einstellungen notwendig sein, um die Zuverlässigkeit der Hintergrundaktualisierung zu verbessern und unerwarteten <a href='#app_crash' target='_blank' rel='noopener'>Abstürzen der Corona-Warn-App beim Öffnen</a> der App möglicherweise vorzubeugen. Dies gilt insbesondere für ältere Geräte mit EMUI 4, aber auch für neuere Geräte.",
                            "Nach aktuellen Informationen scheint für neuere Huawei-Geräte ein System-Update verfügbar zu sein, das explizit die Probleme mit der Corona-Warn-App beheben soll.",
                            "Die GitHub-Community hat Vorschläge zum Vornehmen zusätzlicher Einstellungen zusammengetragen, und auch Informationen über das System-Update verlinkt. Sie finden alle Details in diesem <a href='https://github.com/corona-warn-app/cwa-app-android/issues/1053#issuecomment-690615368' target='_blank' rel='noopener noreferrer'>GitHub-Issue</a>."
                         ]
                    }
                ]
            },
            {
                "title": "Meldungen",
                "id": "notification",
                "accordion": [
                    {
                        "title": "[Apple/iOS] 'ExposureDetectionIsAlreadyRunning' in CWA version 1.6.1",
                        "anchor": "ExposureDetectionIsAlreadyRunning",
                        "active": true,
                        "textblock": [                            
                            "Die Meldung <a href='https://github.com/corona-warn-app/cwa-app-ios/issues/1497'>'ExposureDetectionIsAlreadyRunning'</a> <a href='https://github.com/corona-warn-app/cwa-app-ios/issues/1512#issuecomment-727206633'>kann ignoriert werden</a>. Die CWA funktioniert korrekt und dieses Problem wird in einem <a href='https://github.com/corona-warn-app/cwa-app-ios/pull/1510'> bevorstehenden Update korrigiert</a>."
                        ]
                    },
                    {
                        "title": "Meine Begegnungsüberprüfung zeigt mehrere zeitgleiche Einträge. Ist das ein Fehler?",
                        "anchor": "multiple_exposure_checks",
                        "active": true,
                        "textblock": [
                            "Sobald die App die aktuellen Diagnoseschlüssel vom Server lädt, wird eine Überprüfung der Begegnungsaufzeichnungen durchgeführt. Dabei wird für jeden der letzte 14 Tage, für den Diagnoseschlüssel vorhanden sind, eine separate Überprüfung der Begegnungsaufzeichnungen durchgeführt. Es ist also daher kein Fehler, dass pro Tag mehrere Einträge in der Überprüfungs-Historie vorhanden sind. Sie können zudem auf die Überprüfungseinträge klicken und sehen, dass immer unterschiedlich viele Schlüssel geprüft werden."
                        ]
                    },
                    {
                        "title": "In den Begegnungsüberprüfungen sind die Aufzeichnungen von weniger als 14 Tagen gespeichert",
                        "anchor": "exposure_check",
                        "active": true,
                        "textblock": [
                            "Die Einstellungen Ihres Smartphones zeigen die Begegnungsüberprüfungen der letzten 14 Tage an: Apple: 'Begegnungsüberprüfungen', Android: 'Überprüfung auf mögliche Begegnungen'. Wenn die App in den letzten 2 Wochen dauerhaft aktiv war, sollten Sie 14 Überprüfungen in den letzten 24 Stunden sehen.","Bitte beachten Sie: Diese Übersicht zeigt nur die Historie an. Jeden Tag werden die Begegnungen der letzten 14 Tage geprüft und das Risiko daraus ermittelt. Wichtig ist also, dass die Übersicht Begegnungsüberprüfungen während der letzten 24 Stunden anzeigt.","Es kann vorkommen, dass hier Einträge für weniger als 14 Tage angezeigt werden, obwohl die Risiko-Ermittlung an jedem der letzten 14 Tagen korrekt durchgeführt wurde. Dafür gibt es mehrere Gründe:","<ol><li>Diese Übersicht hat ein festes Limit von 100 Einträgen auf iOS Geräten. Wird dieses Limit überschritten, werden nur die neuesten Einträge behalten. Sie sehen dann typischerweise die Einträge von 7 Tagen. Wir sind mit Apple in Kontakt, damit die Übersicht in Zukunft vollständig angezeigt wird. Die Protokollgrenze von 100 Einträgen auf Android-Geräten wurde kürzlich von Google Ende August 2020 entfernt.</li><li>Manchmal werden nur 13 Einträge für einen Kalendertag angezeigt. Der 14. Eintrag wurde nach der Überprüfung gelöscht. Das kann passieren, wenn sich der Zeitpunkt des Herunterladens der Schlüssel vom Server und der Zeitpunkt des Löschen von Schlüsseln auf Ihrem Smartphone, die älter als 14 Tage sind, überschneiden. Auch hier gilt, die Risiko-Ermittlung hat funktioniert. Eine ausführliche Erklärung mit Beispiel finden Sie (auf Englisch) unter <a href='https://github.com/corona-warn-app/cwa-app-ios/issues/921#issuecomment-664301639' target='_blank' rel='noopener noreferrer'>https://github.com/corona-warn-app/cwa-app-ios/issues/921#issuecomment-664301639</a>.</li><li>Wenn Sie die App erst seit Kurzem nutzen (zum Beispiel seit 5 Tagen), werden entsprechend weniger Überprüfungen in den letzten 24 Stunden (hier 5 Überprüfungen) angezeigt, eine für jeden Tag, an dem die Corona-Warn-App lief.</li></ol>"
                        ]
                    },
                    {
                        "title": "[Google/Android]: „Etwas ist schiefgelaufen. Aufgrund eines technischen Problems wurde Ihre App zurückgesetzt.“",
                        "anchor": "cause9002_recovery",
                        "active": true,
                        "textblock": [
                            "Ab Corona-Warn-App Version 1.5.0 oder höher kann es vorkommen, dass Sie nach dem Öffnen der App die Benachrichtigung „Etwas ist schiefgelaufen. Aufgrund eines technischen Problems wurde Ihre App zurückgesetzt.“ sehen.",
                            "<h4>Was ist passiert?</h4> Beim Zugriff auf die Datenbank ist es zu einem Fehler gekommen, der dazu führt, dass nicht mehr auf die verschlüsselten Daten zugegriffen werden kann. Die Corona-Warn-App hat diesen Fehler erkannt und die Datenbanken automatisch zurückgesetzt, so dass der Zugriff nun wieder funktioniert und die Corona-Warn-App Sie weiterhin über Ihren Risikostatus informieren kann. Weitere technische Details zu diesem Problem finden Sie unten.",
                            "<h4>Was sollten Sie beachten?</h4> <b>Das Zurücksetzen der Datenbanken hat keine Auswirkung auf die Risiko-Ermittlung und damit auch nicht auf Ihren Risikostatus.</b> Alle aufgezeichneten Begegnungen mit anderen Personen, die die App nutzen, bleiben erhalten. Sie werden weiterhin über Risiko-Begegnungen benachrichtigt und können andere warnen, falls Sie positiv auf COVID-19 getestet wurden.",
                            "<b>Falls Sie aber einen QR-Code für die elektronische Benachrichtigung über einen COVID-19-Test eingelesen haben und Ihnen das Testergebnis bislang noch nicht in der App übermittelt wurde, ist durch das Zurücksetzen der Datenbanken die Registrierung des Tests für die elektronische Übermittlung verloren gegangen. Aus Datenschutzgründen kann der QR-Code leider nicht mehr erneut eingelesen werden. Bitte wenden Sie sich an Ihren Arzt oder das Labor, um Ihr Testergebnis zu erfahren.</b>",
                            "Durch das Zurücksetzen der Daten geht auch die Information verloren, wie lange Ihre App bereits aktiv war (die Anzahl der aktiven Tage wird auf 0 gesetzt). Gegebenenfalls wurden auch Einträge aus der Historie der Begegnungsaufzeichnungen entfernt, die Sie über die Einstellungen zu Ihrem Google-Konto erreichen. (siehe <a href='#exposure_check' target='_blank' rel='noopener noreferrer'>hier</a> und <a href='#keys_matches' target='_blank' rel='noopener noreferrer'>hier</a>) Dies hat jedoch keine Auswirkungen auf die Risiko-Ermittlung und Ihren Risikostatus. Spätestens nach 24 Stunden sollte Ihnen Ihr Risikostatus wieder angezeigt werden und neue Einträge in der Historie der Begegnungsaufzeichnungen sollten erscheinen.",
                            "<h4>Technischer Hintergrund</h4> Die Corona-Warn-App wurde mit höchsten Ansprüchen an den Datenschutz entwickelt. Dafür werden einerseits Daten verschlüsselt abgespeichert und andererseits der Programmcode der App öffentlich zur Begutachtung zur Verfügung gestellt (<a href='#open-source' target='_blank' rel='noopener noreferrer'>Open-Source-Ansatz</a>). Um eine Datenverschlüsselung für eine App zu realisieren, greifen Entwickler gerne auf in der Vergangenheit bereits gut erprobte Programmmodule zurück, die von anderen Entwicklern ebenfalls als Open-Source zur Verfügung gestellt werden. Auf diese Weise kann Transparenz für sämtliche Bestandteile der Corona-Warn-App gewährleistet werden. Erst kürzlich wurde bekannt, dass ein Verschlüsselungsmodul, das auch von der Corona-Warn-App genutzt wird, fehlerhaft funktioniert, wenn der im Android Betriebssystem integrierte Speicher für Schlüssel oder Passwörter nicht zuverlässig reagiert. Dieser Fehler führt dazu, dass eine verschlüsselte Datenbank nicht mehr geöffnet werden kann. Das wiederum führt dazu, dass einige Nutzer die Meldung „<a href='#cause9002' target='_blank' rel='noopener noreferrer'>Ursache: 9002 Etwas ist schief gelaufen (sqlite)</a>“ sehen oder <a href='#app_crash' target='_blank' rel='noopener noreferrer'>sich die App nicht mehr öffnen lässt</a>. Selbstverständlich wird die Corona-Warn-App vor jeder Veröffentlichung eines Updates gründlich getestet. Allerdings trat dieser Fehler während der Tests nie auf und er lässt sich auch jetzt nur schwer reproduzieren.",
                            "Alle Beteiligten arbeiten gemeinsam an einer möglichst raschen Fehlerbehebung."
                        ]
                    },
                    {
                        "title": "Probleme mit anderen Apps und Geräten, die Bluetooth verwenden",
                        "anchor": "various_device_problems",
                        "active": true,
                        "textblock": [
                            "Seit ich die App installiert habe, macht mein Smartphone manchmal Probleme. Beispiel: Es gibt es manchmal Probleme mit anderen Apps und Geräten, die Bluetooth verwenden. Was kann ich tun?",
                            "Einige Nutzer melden, dass sich ihr Smartphone manchmal seltsam verhält. Beispiel: Ab und zu bricht die Kommunikation zwischen dem Smartphone und Bluetooth-Geräten über andere Apps ab. Dies betrifft z. B. Smartwatches oder Bluetooth-Ohrhörer. Wir untersuchen diese Probleme, allerdings liegt es vermutlich an grundlegenden Funktionen des Betriebssystems, auf die wir keinen Einfluss haben.", 
                            "Versuchen Sie bitte Folgendes: <ul><li>Starten Sie Ihr Smartphone neu.</li><li>Entkoppeln Sie die anderen über Bluetooth verbundenen Geräte und koppeln Sie sie neu.</li></ul>",
                            "Wenn das nicht weiterhilft, wenden Sie sich an den Hersteller Ihres Geräts:",
                            "<ul><li[Apple/iOS]: <a href='https://support.apple.com' target='_blank' rel='noopener noreferrer'>Apple-Support</a>.</li><li>[Google/Android]: <a href='https://support.google.com/android/answer/3094742?hl=en&ref_topic=7313011' target='_blank' rel='noopener noreferrer'>Hilfe vom Hersteller Ihres Geräts</a>.</li></ul>"
                        ]
                    }
                ]
            },
            {
                "title": "Verfügbarkeit",
                "id": "availability",
                "accordion": [
                    {
                        "title": "Welche Systemvoraussetzungen muss mein Smartphone erfüllen?",
                        "anchor": "minimum_requirements",
                        "active": true,
                        "textblock": [
                            "[Apple/iOS]: Die App läuft auf iOS-Smartphones ab dem iPhone 6s. Die Version des Betriebssystems muss iOS [ios.minimum-required-os-version] oder höher sein, da mit dieser Version die Exposure Notification API eingeführt wurde.",
                            "[Google/Android]: Die App läuft auf Smartphones ab Android [android.minimum-required-os-version]. Die Exposure Notification API wurde hier bereits über die Google-Play-Dienste eingespielt.",
                            "Weitere Fragen zu den Betriebssystemen können nur die Hersteller selbst beantworten."
                        ]
                    },
                    {
                        "title": "Ich teste eine Beta-Version von iOS. Warum wird die Corona-Warn-App noch nicht unterstützt?",
                        "anchor": "beta_ios",
                        "active": true,
                        "textblock": [
                            "Wir unterstützen offiziell keine Beta-Versionen der jeweiligen Betriebssysteme. Diese sind noch in der Entwicklung und nicht für den produktiven Betrieb vorgesehen.",
                            "Wenn Sie als Teilnehmer am Apple Beta Software-Programm jedoch frühzeitig auf potentielle Fehler oder Inkompatibilitäten hinweisen möchten, <a href='https://github.com/corona-warn-app/cwa-app-ios/issues' target='_blank' rel='noopener noreferrer'>nehmen wir Ihr Feedback gerne auf Github entgegen</a>."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Warum ist iOS [ios.minimum-required-os-version] Mindestvoraussetzung?",
                        "anchor": "ios135",
                        "active": true,
                        "textblock": [
                            "Apple hat die erforderliche Schnittstelle für Verfolgung von Begegnungen (Exposure Notification API) mit iOS 13.5 eingeführt, siehe <a href='https://support.apple.com/de-de/HT210393#135' target='_blank' rel='noopener noreferrer'>Informationen zu iOS 13-Updates</a>. Mit dem Release 1.5 der Corona-Warn-App wird nun iOS 13.6 vorausgesetzt, da die Exposure Notification API nochmal angepasst und verbessert wurde. Die unterstützten Gerätemodelle finden Sie unter anderem hier: <a href='https://support.apple.com/de-de/guide/iphone/iphe3fa5df43/ios' target='_blank' rel='noopener noreferrer'>Unterstützte iPhone-Modelle</a>. Leider bietet Apple keine Unterstützung mehr für Geräte an, die älter als 4-5 Jahre sind. An diesen Gegebenheiten können wir als App-Entwickler leider nichts ändern."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Kann ich die App auch auf einem gerooteten Gerät nutzen?",
                        "anchor": "rooted_devices",
                        "active": true,
                        "textblock": [
                            "Nein, die App wird auf gerooten Geräten nicht unterstützt."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Warum sind Android [android.minimum-required-os-version] und Google Play-Dienste Mindestvoraussetzungen?",
                        "anchor": "googleplay",
                        "active": true,
                        "textblock": [
                            "Google liefert die erforderliche Schnittstelle für Verfolgung von Begegnungen (Exposure Notification API) über die Google Play-Dienste aus. Die API wird ab Android API Level 23 unterstützt. Diese Version ist ab Android-Version [android.minimum-required-os-version] verfügbar, siehe <a href='https://source.android.com/setup/start/build-numbers' target='_blank' rel='noopener noreferrer'>Codenames, Tags, and Build Numbers</a>. Diese Entscheidung wurde alleine von Google getroffen. Zudem fehlt auf älteren Geräten oft auch geräteseitig die Unterstützung für Bluetooth Low Energy. An diesen Gegebenheiten können wir als App-Entwickler leider nichts ändern."
                        ]
                    },
                    {
                        "title": "In welchen Sprachen gibt es die Corona-Warn-App?",
                        "anchor": "available_languages",
                        "active": true,
                        "textblock": [
                            "Die App ist in den folgenden Sprachen verfügbar:<ul><li>Deutsch</li><li>Englisch</li><li>Türkisch (ab Version 1.1.1)</li><li>Bulgarisch (ab Version 1.2.0)</li><li>Polnisch (ab Version 1.2.0)</li><li>Rumänisch (ab Version 1.2.0)</li></ul>",
                            "Die Hotline (<a href='tel:+498007540001'>+49 800 7540001</a>) wird auf Deutsch, Englisch und Türkisch bedient. Weitere Sprachen sind geplant. Wir halten Sie auf dem Laufenden.", "Die Sprache der App orientiert sich an der Sprache, die in den Systemeinstellungen Ihres Smartphones eingestellt ist. Um die App etwa auf Englisch anzuzeigen, ändern Sie die Sprache in den Einstellungen Ihres Smartphones auf Englisch.",
                            "Bitte beachten Sie, dass viele Länder eigene Corona-Apps haben. Weil die deutsche Corona-Warn-App auch in den App Stores und Play Stores dieser Länder verfügbar ist, könnten die Corona-Apps verwechselt werden. Achten Sie daher darauf, dass Sie die App Ihres Landes herunterladen."

                        ]
                    },
                    {
                        "title": "In welchen internationalen App Stores ist die App verfügbar?",
                        "anchor": "international",
                        "active": true,
                        "textblock": [
                            "Nach eingehender Prüfung der Situation wurde festgestellt, dass eine Veröffentlichung der Corona-Warn-App in App Stores außerhalb von Deutschland im Moment aus rechtlichen Gründen nur nach einer Einzelfallprüfung möglich ist. Rechtliche Beratungen haben ergeben, dass bei einer Veröffentlichung in internationalen App-Stores das Recht des entsprechenden Landes zu berücksichtigen und auf die Corona-Warn-App anzuwenden ist. Das gilt insbesondere für den Datenschutz, eventuell nötige Auskunftsansprüche dortiger Behörden sowie weitere Vertrags- und Verbraucherschutzregularien.",
                            "Das Robert Koch-Institut als Herausgeber der App wird diese Prüfung für die entsprechenden Länder veranlassen und die App nach erfolgreicher rechtlicher Prüfung freischalten. Derzeit hat das RKI die App für folgende Staaten Europas freigeben: <ul><li>Belgien</li><li>Bulgarien</li><li>Deutschland</li><li>Dänemark</li><li>Finnland</li><li>Frankreich</li><li>Griechenland</li><li>Irland</li><li>Island</li><li>Italien</li><li>Kroatien</li><li>Lettland</li><li>Litauen</li><li>Luxemburg</li><li>Malta</li><li>Niederlande</li><li>Norwegen</li><li>Österreich</li><li>Polen</li><li>Portugal</li><li>Rumänien</li><li>Schweiz</li><li>Slowakei</li><li>Slowenien</li><li>Spanien</li><li>Schweden</li><li>Tschechische Republik</li><li>Ungarn</li><li>Vereinigtes Königreich</li><li>Zypern</li></ul>",
                            "Weitere Länder werden im Moment geprüft und schrittweise in den App Stores freigegeben. Das Robert Koch-Institut bittet um Verständnis, dass es während des laufenden Überprüfungsprozesses zu konkreten Ländern und dem Status ihrer Freigabe keine Auskunft erteilen kann.",
                            "Bitte beachten Sie, dass viele Länder eigene Corona-Apps haben. Weil die deutsche Corona-Warn-App auch in den App Stores und Play Stores dieser Länder verfügbar ist, könnten die Corona-Apps verwechselt werden. Achten Sie daher darauf, dass Sie die App Ihres Landes herunterladen."
                        ]
                    },
                    {
                        "title": "In welchen Ländern kann die Corona Warn App genutzt werden?",
                        "anchor": "interoperability_countries",
                        "active": true,
                        "textblock": [
                            "Gemeinsam mit der EU-Kommission wurde eine Infrastruktur für einen sicheren Informationsaustausch entwickelt, die als sog. \"Interoperability Gateway\" bezeichnet wird. Dieses Gateway ermöglicht, dass die Corona-Warn-App über Landesgrenzen hinaus funktioniert und auch im Ausland potentielle Warnmeldungen empfangen werden können. Detaillierte Informationen zum Gateway bietet die EU-Kommission unter <a href='https://ec.europa.eu/commission/presscorner/detail/de/qanda_20_1905#gateway'>Coronavirus: EU-Datenabgleichsdienst für Kontaktnachverfolgungs- und Warn-Apps – Fragen und Antworten</a>.",
                            "Um weitere Informationen in der App zu sehen, klicken Sie",
                            "<ol><li>'RISIKO-ERMITTLUNG AKTIV (bzw. GESTOPPT) an'</li><li>Dann auf 'Länderübergreifende Risiko Ermittlung' klicken.</li><li>Als letztes scorllen Sie nach unten zu der Liste der Länder.</li></ol>",
                            "Nachstehend finden Sie eine Liste der derzeit teilnehmenden Länder und Angaben zu den zuständigen Gesundheitsbehörden:",
                            "(Stand: 16.11.2020)",
                            "<table class='table'><thead><tr><th>Land</th><th>Verantwortlicher</th><th>Kontaktdaten</th></tr></thead><tbody><tr><td>Dänemark<br>(ab 6.11.2020)</td><td>Styrelsen for Patientsikkerhed (Danish Patient Safety Authority)</td><td>Styrelsen for Patientsikkerhed<br>Islands Brygge 67<br>2300 København S<br>Denmark<br>E-Mail: stps@stps.dk<br>Telefon: +45 72286600</td></tr><tr><td>Deutschland<br>(ab 17.10.2020)</td><td>Robert-Koch-Institut</td><td>Robert-Koch-Institut<br>Nordufer 20<br>13353 Berlin<br>Germany<br>E-Mail: CoronaWarnApp@rki.de<br>Telefon: +49 30187540</td></tr><tr><td>Irland<br>(ab 19.10.2020)</td><td>Health Service Executive</td><td>Dr Steevens’ Hospital<br>Steevens Lane<br>Dublin 8<br>Irland<br>E-Mail: cio@hse.ie<br>Telefon: +353 87 688 3565</td></tr><tr><td>Italien<br>(ab 19.10.2020)</td><td>Ministry of Health</td><td>Ministry of Health<br>Viale Giorgio Ribotta 5<br>00144 Rome<br>Italy<br>E-Mail: segretariato.generale@sanita.it<br>Telefon: +39 65994694546</td></tr><tr><td>Kroatien<br/>(ab 16.11.2020)</td><td>AZOP Croatian Personal Data Protection Agency</td><td>AZOP Croatian Personal Data Protection Agency<br>Selska cesta 136<br>10000 Zagreb<br>Croatia<br>E-Mail: azop@azop.hr<br>Telefon: + 385 14609000</td></tr><tr><td>Lettland<br>(ab 6.11.2020)</td><td>Slimību profilakses un kontroles centrs</td><td>Slimību profilakses un kontroles centrs (SPKC)<br>Duntes iela 22, k-5<br>Rīga, LV 1005<br>Lettland<br>E-Mail: pasts@spkc.gov.lv<br>Telefon:  +371 675015 90 oder -91</td></tr><tr><td>Spanien<br>(ab 6.11.2020)</td><td>Ministerio de Asuntos Economicos y Transformacion Digital</td><td>Ministerio de Asuntos Economicos y Transformacion Digital<br>P. de la Castellana, 162<br>28071 Madrid<br>Spanien<br>E-Mail: soporte.radarcovid@economia.gob.es<br>Telefon: + 34 91 258 28 52</td></tr><tr><td>Tschechien<br/>(bevorstehend)</td><td>Ministry of Health</td><td>Ministry of Health<br>Palackého náměstí 4<br>120 00 Praha 2<br>Czech Republic<br>E-Mail: mzcr@mzcr.cz<br>Telefon: +420 224971111</td></tr></tbody></table>"
                        ]
                    },
                    {
                        "title": "Warum gibt es für die Verwendung der Corona-Warn-App auf Android und Apple unterschiedliche Altersbeschränkungen?",
                        "anchor": "age_restriction",
                        "active": true,
                        "textblock": [
                            "Die App richtet sich an Personen, die mindestens 16 Jahre alt sind. Selbstverständlich bleibt es Sorgeberechtigten unbenommen, die Nutzung der App auch Kindern und Jugendlichen unter 16 Jahren zu erlauben.",
                            "Welche Altersbeschränkungen im Apple App Store und im Google Play Store gelten, legen hingegen ausschließlich die jeweiligen Unternehmen anhand verschiedener Kriterien fest. Daher liegt die Altersbeschränkung im Apple App Store bei '12+' und beim PlayStore bei '0+'."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Die App ist nicht als APK verfügbar, weder auf GitHub, noch auf F-Droid usw. Wird die App auch als APK veröffentlicht?",
                        "anchor": "apk",
                        "active": true,
                        "textblock": [
                            "Eine Auslieferung auf alternativen Wegen (Download per APK, F-Droid etc.) ist aus verschiedenen Gründen nicht geplant.",
                            "Zum einen liegt die Verantwortung für die Auslieferung der App beim Robert Koch-Institut, welches rechtlich und inhaltlich für die Verteilung verantwortlich ist. Im Moment ist hier nur die Auslieferung über die jeweiligen App Stores im Fokus. Weiterhin funktioniert die App nur mit Google Play Services. Mit einer Verteilung über den Play Store kann davon ausgegangen werden, dass Google Play Services installiert sind. Auf anderen Vertriebswegen können wir diese Annahmen im Moment nicht treffen.",
                            "Die Auslieferung der bestehenden App auf anderen Kanälen ist im Moment als Anfrage auf <a href='https://github.com/corona-warn-app/cwa-wishlist/issues/57' target='_blank' rel='noopener noreferrer'>corona-warn-app/cwa-wishlist#57</a> publiziert. Die Diskussion rund um alternative Vertriebsplattformen wie F-Droid findet sich auf <a href='https://github.com/corona-warn-app/cwa-documentation/issues/5' target='_blank' rel='noopener noreferrer'>corona-warn-app/cwa-documentation#5</a>.",
                            "Weiterhin gibt es in der Entwickler-Community eine Initiative, die Corona-Warn-App über entsprechende Erweiterungen unabhängig von Google Play Services lauffähig zu bekommen. Details hierzu finden sich im Issue <a href='https://github.com/corona-warn-app/cwa-app-android/issues/75' target='_blank' rel='noopener noreferrer'>corona-warn-app/cwa-app-android#75</a>."
                        ]
                    },
                    {
                        "title": "Wird es die App auch für Tablets, Smartwatches und andere Wearables geben?",
                        "anchor": "smartwatch",
                        "active": true,
                        "textblock": [
                            "Eine Umsetzung auf Tablets, Smartwatches und Wearables ist im Moment nicht geplant. Wir konzentrieren uns – auch aufgrund der Verfügbarkeit der nötigen Schnittstellen – ausschließlich auf Smartphones. Sollte sich daran etwas ändern, werden wir das entsprechend kommunizieren und bewerben."
                        ]
                    },
                    {
                        "title": "Wird die App auch auf alternativen Plattformen zu App Store und Google Play Store zur Verfügung gestellt? ",
                        "anchor": "other_platforms",
                        "active": true,
                        "textblock": [
                            "Es ist im Moment nicht absehbar, wann und ob wir die App in anderen App Stores außer denen von Google oder Apple zur Verfügung stellen können. Die App wird die Apple und Google Exposure Notification APIs verwenden. Die Community kann sich gerne einbringen und die App für andere APIs übernehmen."
                        ]
                    },
                    {
                        "title": "Wo bekomme ich die App?",
                        "anchor": "where_to_get",
                        "active": true,
                        "textblock": [
                            "Seit die App zur Verfügung steht, können Sie sie im App Store von Apple bzw. im Google Play Store herunterladen."
                        ]
                    }
                ]
            },
            {
                "title": "Anwendung",
                "id": "application",
                "accordion": [
                    {
                        "title": "Was mache ich, wenn ich mehrere QR-Codes habe?",
                        "anchor": "QRcodes",
                        "active": true,
                        "textblock": [
                            "Familien, die zum Beispiel nach dem Urlaub am Flughafen getestet werden, erhalten für jeden Test oft ein Merkblatt, auf dem ein QR-Code abgebildet ist.",
                            "<ol><li>Lesen Sie das Merkblatt aufmerksam durch, ob der QR-Code wirklich in die Corona-Warn-App eingescannt werden soll, oder ob er für ein anderes Test-Verfahren gedacht ist.</li><li>Nur dann, wenn Sie sichergestellt haben, dass der QR-Code für die Corona-Warn-App bestimmt ist und nicht für ein anderes System, können Sie in der Corona-Warn-App fortfahren.</li><li>Sie können jeden QR-Code nur ein einziges Mal in die Corona-Warn-App einscannen, danach verfällt der QR-Code. Das schließt Missbrauch aus.</li><li>Wenn Sie einen QR-Code für Ihren eigenen Test erhalten haben, scannen Sie den QR-Code ein und warten Sie im Anschluss bis das Ergebnis übermittelt wird. Das kann mehrere Stunden bis wenige Tage dauern. Öffnen Sie dazu die Corona-Warn-App regelmäßig und überprüfen Sie, ob das Testergebnis bereits vorliegt.</li><li>Wenn Sie weitere QR-Codes für Tests Ihrer Familienmitglieder erhalten haben, zum Beispiel Ihre Kinder, die aber kein eigenes Smartphone haben, verwenden Sie diese QR-Codes NICHT in Ihrem eigenen Gerät. Der QR-Code darf ausschließlich für Ihren persönlichen Test und Ihr persönliches Smartphone verwendet werden. Die Testergebnisse aller Familienmitglieder werden Ihnen auf jeden Fall nochmals unabhängig von der Corona-Warn-App (in der Regel per Telefon) mitgeteilt.</li><li>Wenn Ihr QR-Code nicht funktioniert und Sie ein positives Testergebnis erhalten haben: Rufen Sie die Verifizierungs-Hotline (+49 800 7540002) an, um eine TeleTAN zu erhalten. Diese können Sie in der Corona-Warn-App eingeben, sodass Ihre Begegnungen der vergangenen Tage über die Corona-Warn-App gewarnt werden können. Beachten Sie die Verhaltenshinweise in der Corona-Warn-App.</li></ol>"
                        ]
                    },
                    {
                        "title": "Was bedeutet die Überprüfung auf mögliche Begegnungen?",
                        "anchor": "keys_matches",
                        "active": true,
                        "textblock": [
                            "Die COVID-19-Begegnungsüberprüfung zeigt an, wie viele Schlüssel, die einem gemeldeten positiven Testergebnis zuzuordnen sind, vom Server heruntergeladen wurden, und wie viele davon mit Schlüsseln, die Ihr Smartphone eingesammelt hat, übereinstimmen. Mehr zum Ablauf finden Sie unter <a href='#risk_info' target='_blank' rel='noopener noreferrer'>Wie werde ich über ein Infektionsrisiko informiert?</a>",
                            "<b>Begegnungsüberprüfungen</b> (Apple) | <b>Überprüfungen auf mögliche Begegnungen</b> (Android)",
                            "Dieser Wert gibt nicht die Anzahl der Begegnungen wieder. Bitte klicken Sie eine Stufe weiter: Dort sind die Überprüfungen von bis zu 15 Tagen protokolliert (heute plus die letzten 14 Tage). Das Auswählen eines Eintrages führt zur Detailansicht mit den entsprechenden Zeitstempeln und der Anzahl der abgeglichenen Schlüssel.",
                            "<b>Anzahl der bereitgestellten Schlüssel</b> (Apple) | <b>Anzahl der Schlüssel</b> (Android)",
                            "Das ist die Anzahl der Schlüssel, welche zu einem gemeldeten, positiven Testergebnis gehören, sogenannte Positivkennungen, die Ihr Smartphone vom Server heruntergeladen hat.",
                            "<b>Anzahl der abgeglichenen Schlüssel</b> (Apple) | <b>Anzahl der Treffer</b> (Android)",
                            "Das ist die Anzahl der Schlüssel, die Ihr Smartphone eingesammelt hat, für die der Abgleich eine Positivkennung gefunden hat. Wenn hier nicht 0 steht, dann hatten Sie eine Risiko-Begegnung. Wenn Ihr Risikostatus dennoch grün, also Niedriges Risiko, ist, lesen Sie bitte unter <a href='#encounter_but_green' target='_blank' rel='noopener noreferrer'>Ich habe eine Risiko-Begegnung, mir wird aber nach wie vor ein niedriges Risiko angezeigt</a> weiter.",
                            "<b>Zeitstempel</b>",
                            "Datum und Uhrzeit an dem der Abgleich durchgeführt wurde. Diese ist unabhängig vom Zeitpunkt eventueller Begegnungen, da für jeden Diagnoseschlüssel in der Datei ein separates Gültigkeitsdatum abgelegt ist.",
                            "<b>Datenquelle</b>",
                            "App die den Abgleich veranlasst hat. Haben sie z.B. noch Immuni oder SwissCovid installiert, könnten auch deren App-Identifier dort an Stelle von 'Corona-Warn' stehen.",
                            "<b>Hash</b>",
                            "Prüfsumme für die Datei der heruntergeladenen Positivschlüssel. Sofern der Dateiinhalt (Positivkennungen) gleich bleibt, verändert sich auch diese Prüfsumme einer Datei für den relevanten Zeitraum von 2 Wochen nicht."
                        ]
                    },
                    {
                        "title": "Muss ich die App immer geöffnet lassen, damit Begegnungen aufgezeichnet werden?",
                        "anchor": "close_app",
                        "active": true,
                        "textblock": [
                            "Nein. Solange Sie in der App die Risiko-Ermittlung aktiviert und Bluetooth (und bei Android den Standort) eingeschalten haben, werden Begegnungen aufgezeichnet. Sie können die App schließen, sowohl durch Minimieren als auch durch 'Swipe-to-quit'.",
                            "Sicherheitshalber öffnen Sie die App täglich nach Ablauf von 24 Stunden einmal. Weitere Hinweise finden Sie unter <a href='https://www.coronawarn.app/de/#howto' target='_blank' rel='noopener noreferrer'>So funktioniert die App am besten</a>.",
                            "Damit der Risikostatus automatisch aktualisiert werden kann, muss die Hintergrundaktualisierung aktiviert sein. Alle Infos dazu finden Sie in diesen FAQs:",
                            "<ul><li><a href='#no_risk_update_ios' target='_blank' rel='noopener'>Apple: Mein Risikostatus wurde seit über einem Tag nicht mehr aktualisiert. Internet war aber verfügbar, was läuft hier falsch?</a></li><li><a href='#no_risk_update' target='_blank' rel='noopener'>Android: Mein Risikostatus wurde seit über einem Tag nicht mehr aktualisiert. Internet war aber verfügbar, was läuft hier falsch?</a></li></ul>"
                        ]
                    },
                    {
                        "title": "Wie werden die Tage seit der letzten Begegnung gezählt?",
                        "anchor": "days_last_risk_encounter",
                        "active": true,
                        "textblock": [
                            "Die Anzahl der Tage werden normal numerisch gezählt - '1 Tag seit der letzten Begegnung' heisst somit 'gestern', '2' demnach 'vorgestern'. Die Details zur technischen Implementation <a href='https://developer.apple.com/documentation/exposurenotification/enexposuredetectionsummary/3583708-dayssincelastexposure'>erklärt Apple hier.</a>"
                        ]
                    },
                    {
                        "title": "Was passiert, wenn ich Bluetooth und bei Android auch die Standort-Dienste ausschalte?",
                        "anchor": "bluetooth_off",
                        "active": true,
                        "textblock": [
                            "Dann können Begegnungen mit den anderen Smartphones, die die Corona-Warn-App laufen haben, nicht aufgezeichnet werden, weil keine Zufalls-IDs ausgetauscht werden. Haben Sie deswegen bitte immer Bluetooth und bei Android auch die Standort-Dienste aktiviert, wenn Sie in Kontakt mit anderen Leuten sind, zum Beispiel, wenn Sie Gäste bekommen oder Sie unterwegs sind.",
                            "Bei Android müssen die Standort-Dienste nur aktiviert sein, die Corona-Warn-App verwendet den Standort nicht. Für alle anderen Apps können Sie die Standortverwendung ausschalten, wenn Sie das möchten: siehe <a href='#android_location' target='_blank' rel='noopener'>Meldungen zur Aktivierung der Standortverwendung</a>."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Funktioniert die Risiko-Ermittlung noch, wenn ich Bluetooth im Kontrollzentrum abschalte, aber in den Systemeinstellungen aktiviert lasse?",
                        "anchor": "ios_logging_bt",
                        "active": true,
                        "textblock": [
                            "Ja. Mit der Option im Kontrollzentrum (siehe <a href='https://support.apple.com/de-de/HT208086' target='_blank' rel='noopener noreferrer'>Bluetooth und WLAN im Kontrollzentrum verwenden</a>) trennen Sie lediglich vorübergehend die Verbindung zum aktuell verbundenen Bluetooth-Zubehör. Bluetooth an sich ist in den Systemeinstellungen aber nach wie vor aktiv."
                        ]
                    },
                    {
                        "title": "Werden die gesammelten Zufalls-IDs in meiner Smartphone-Datensicherung (Backup) berücksichtigt?",
                        "anchor": "backup",
                        "active": true,
                        "textblock": [
                            "Nein, diese sind nicht Bestandteil der Datensicherung. Das heißt, die gesammelten Zufalls-IDs können auch nicht auf dem selben oder einem anderen Gerät wiederhergestellt werden."
                        ]
                    },
                    {
                        "title": "Werden die gesammelten Zufalls-IDs beim Deinstallieren der App entfernt?",
                        "anchor": "delete_random_ids",
                        "active": true,
                        "textblock": [
                            "Eine Deinstallation der App sollte immer die letzte mögliche Lösung für bekannte oder neu auftretende Probleme sein.",
                            "Die App selbst kann die Covid-19-Begegnungsaufzeichnungen nicht löschen. Daher obliegt es dem Exposure Notification System (ENS) zu entscheiden, ob diese Daten gelöscht werden oder nicht.",
                            "In der derzeitigen Version bleiben bei einer Deinstallation unter iOS die Begegnungsaufzeichnungen erhalten. Es gibt jedoch keine Garantien, wie lange diese Daten vorgehalten werden.",
                            "Auf Android-Geräten werden in der derzeitigen Implementierung beim Deinstallieren <a href='https://developers.google.com/android/exposure-notifications/exposure-notifications-api#methods' target='_blank' rel='noopener noreferrer'>'Datenbank und Schlüssel' vom Gerät gelöscht</a>. Sie sollten daher davon ausgehen, dass mit Deinstallation der App auch die Begegnungsaufzeichnungen verloren gehen.",
                            "Da sich dieses Verhalten bei der App-Deinstallation auch ohne Änderungen an der Corona-Warn-App jederzeit ändern kann, sollten sie die App wirklich nur in Ausnahmefällen deinstallieren oder wenn die Hotline oder Entwickler auf GitHub sie explizit darum bitten ",
                            "Wir empfehlen daher, vor der Neu-installation zunächst die Daten in der App zurückzusetzen, da hierbei die gesammelten Zufalls-IDs nicht gelöscht werden:",
                            "<ul><li>[iOS] Auf iOS-Geräten finden Sie die Funktion 'Anwendung zurücksetzen' auf dem Einstiegsbild der App ganz unten unter 'Einstellungen'.</li><li>[Google/Android] Auf Android-Geräten wählen Sie unter den drei Punkten im oberen rechten Bereich des Einstiegsbilds 'Einstellungen' -> 'Anwendung zurücksetzen'.</li></ul>"
                        ]
                    },
                    {
                        "title": "Wie werde ich über ein Infektionsrisiko informiert?",
                        "anchor": "risk_info",
                        "active": true,
                        "textblock": [
                            "So funktioniert die App:",
                            "<ol><li>Alle Smartphones, die die App installiert haben, senden und empfangen pseudonymisierte Schlüssel, die dann lokal auf dem Smartphone gespeichert werden. Die Bluetooth-Verbindung ist nur für das Senden und Empfangen der pseudonymisierten Schlüssel notwendig.</li><li>Falls Sie positiv getestet wurden, können Sie Ihre Diagnoseschlüssel ('Positivkennung') auf den Server hochladen. Alle Smartphones mit der Corona-Warn-App empfangen in regelmäßigen Abständen die Schlüssel von diesem Server und prüfen lokal, ob sie einen übereinstimmenden Schlüssel via Bluetooth lokal gespeichert haben. Hierfür muss Ihr Smartphone Zugang zum Internet haben, zum Beispiel über WLAN oder mobile Daten.</li><li>Gibt es eine Übereinstimmung zwischen einem vom Server heruntergeladenen und einem lokal gespeicherten Schlüssel, dann bedeutet das, dass es eine Begegnung mit einer Person gab, die positiv auf Corona getestet wurde. Für diesen Abgleich von Übereinstimmungen benötigen Sie keine Bluetooth-Verbindung.</li></ol>",
                            "Das <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/solution_architecture.md' target='_blank' rel='noopener noreferrer'>Solution-Architecture-Dokument</a> beschreibt den technischen Ablauf im Detail."
                        ]
                    },
                    {
                        "title": "Wie gebe ich mein negatives Testergebnis ein?",
                        "anchor": "test_negative",
                        "active": true,
                        "textblock": [
                            "Danke für Ihre Bereitschaft zu helfen. Der Grundgedanke der App ist, Ihre Mitmenschen zu warnen, indem Sie ein positives COVID-19-Testergebnis in die App eingeben. Die App sieht deswegen nicht vor, dass Sie ein negatives Testergebnis eingeben."
                        ]
                    },
                    {
                        "title": "Wie teile ich ein positives Testergebnis auf mehreren Geräten?",
                        "anchor": "test_multiple_devices",
                        "active": true,
                        "textblock": [
                            "Wenn Sie mehr als ein Smartphone besitzen und bspw. eines beruflich und eines privat nutzen, empfehlen wir die Installation der CWA zunächst auf Ihrem privaten Gerät. Auch der Scan von QR-Codes und das Teilen eines positiven Ergebnisses sollte zuerst über das private Gerät erfolgen. Wenn Sie darüber hinaus auch über Ihr Firmengerät ein positives Ergebnis teilen möchten, geht dies ausschließlich über eine sog. TeleTAN. Mit einem positiven Testergebnis erhalten Sie unter +49 800 7540002 eine 10-stellige TAN mit der das Testergebnis ebenfalls in der App registriert werden kann. <b>Achtung:</b> Die TAN Nummer ist nur eine Stunde gültig."
                        ]
                    },
                    {
                        "title": "Kann ich positive Testergebnisse aus anderen Ländern eingeben?",
                        "anchor": "test_in_other_country",
                        "active": true,
                        "textblock": [
                            "Wenn Sie sich im EU-Ausland oder in einem <a href='https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Tests.html' target='_blank' rel='noopener noreferrer'>dieser Staaten</a> befinden und dort einen molekularbiologischen Test (PCR-Test) gemacht haben, der positiv ist, können Sie diesen in Ihrer Corona-Warn-App hochladen. Dafür müssen Sie sich unter der Hotline +49 800 7540002 verifizieren lassen. Sie erhalten eine 10-stellige TAN, mit der das Testergebnis in der App registriert werden kann. Achtung: Die TAN ist nur eine Stunde gültig!"
                        ]
                    },
                    {
                        "title": "Kann die Corona-Warn-App die Krankschreibung vom Arzt ersetzen?",
                        "anchor": "sick_leave",
                        "active": true,
                        "textblock": [
                            "Nein, das kann sie nicht. Das Verfahren des QR-Codes wurde zur Verifizierung von positiven Testergebnissen entwickelt. Die Information über die Corona-Warn-App ersetzt nicht den Befundbrief bzw. die Information vom Arzt oder Labor. Nur sie können Ihnen auch einen Nachweis für Ihren Arbeitgeber geben. ",
                            "Der Grund ist folgender: Weil die Corona-Warn-App den dezentralen Ansatz verfolgt, enthalten die Benachrichtigungen der Corona-Warn-App keine persönlichen Informationen wie Name oder Geburtsdatum. Diese Identifizierungsmerkmale sind jedoch für eine Befreiung aus der Quarantäne notwendig.",
                            "Zusätzlich zur Anzeige Ihres Ergebnisses in der Corona-Warn-App sollten Sie immer eine schriftliche Nachricht durch das Labor, die Teststelle oder Ihre Arztpraxis bekommen."
                        ]
                    },
                    {
                        "title": "Wie melde ich mich in der App wieder gesund?",
                        "anchor": "recovered",
                        "active": true,
                        "textblock": [
                            "Wenn Ihr Arzt oder das Gesundheitsamt Ihnen mitgeteilt hat, dass Sie von COVID-19 genesen sind, setzen Sie die Corona-Warn-App zurück:","<ol><li>Öffnen Sie 'Einstellungen'.<ul><li>[Google/Android]: Öffnen Sie das Menü der Corona-Warn-App, indem Sie auf der Startseite auf das 3-Punkte-Icon rechts oben tippen.</li><li>[Apple/iOS]: Scrollen Sie auf der Startseite nach unten.</li></ul></li><li>Tippen Sie auf 'Anwendung zurücksetzen'. Bestätigen Sie, dass Sie die App zurücksetzen wollen.</li><li>Sie kommen auf die Einführungsseiten der Corona-Warn-App.</li><li>Aktivieren Sie dort die Risiko-Ermittlung wieder. Weil nach aktuellem Forschungsstand nicht ausgeschlossen werden kann, dass Sie sich wieder infizieren, können Sie so weiter dazu beitragen, Infektionsketten zu unterbrechen.</li></ol>"
                        ]
                    },
                    {
                        "title": "Ich bin gehörlos oder schwerhörig. Telefonieren ist problematisch für mich. Worauf muss ich bei der Nutzung der App achten?",
                        "anchor": "hearing_impaired",
                        "active": true,
                        "textblock": [
                            "Grundsätzlich: Die App ist barrierefrei entwickelt worden (siehe <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/translations/scoping_document.de.md#barrierefreiheit' target='_blank' rel='noopener noreferrer'>Scoping-Dokument</a>) und unterstützt die gängigen Bedienungshilfen des Smartphone-Betriebssystems.",
                            "In der Regel ist eine Kommunikation per Telefon nicht notwendig. Im Falle eines positiven Befunds erhalten Sie das Testergebnis standardmäßig über einen QR-Code, den Sie mit der App einscannen. Wenn das Testzentrum bzw. das Labor diesen Weg nicht unterstützt oder Sie den QR-Code nicht scannen möchten, erhalten Sie eine TAN. Nur wenn Sie mit einem positiven Befund weder einen QR-Code noch eine TAN erhalten, müssten Sie die Hotline anrufen, was nicht direkt aus der App möglich ist.",
                            "Sollten Sie wegen einer Hörschwäche nicht telefonieren können, empfiehlt es sich, darauf gleich beim Test hinzuweisen, da auch hier für die weitere Kommunikation besondere Maßnahmen einzuhalten sind. So kann sichergestellt werden, dass Sie die TAN - wenn benötigt - gleich schriftlich erhalten."
                        ]
                    },
                    {
                        "title": "Wie oft wird der Risiko-Status aktualisiert?",
                        "anchor": "risk_update_24",
                        "active": true,
                        "textblock": [
                            "Die Corona-Warn-App aktualisiert den Risiko-Status im Abstand von mindestens 24 Stunden. Dabei kann der genaue Zeitpunkt auch einige Stunden nach dem Zeitpunkt der Aktualisierung am Vortag liegen.",
                            "Dass nur etwa alle 24 Stunden aktualisiert wird, liegt zum einen an Beschränkungen der Schnittstelle und gewährleistet zum anderen die Konsistenz zwischen den Corona-Warn-App-Versionen für iOS und Android.",
                            "Eine ausführliche technische Begründung dafür finden Sie in englischer Sprache in Github unter <a href='https://github.com/corona-warn-app/cwa-backlog/issues/2#issuecomment-647740143' target='_blank' rel='noopener noreferrer'>https://github.com/corona-warn-app/cwa-backlog/issues/2#issuecomment-647740143</a>.",
                            "Das Thema ist aufgenommen und wird so bald wie möglich von der Entwicklung bearbeitet."
                        ]
                    },
                    {
                        "title": "Wenn ich die App außerhalb eines WLANs nutze, kommen dann Kosten für die Übertragung mobiler Daten auf mich zu?",
                        "anchor": "mobile_data_costs",
                        "active": true,
                        "textblock": [
                            "Die deutschen Netzbetreiber haben sich zu einem sog. Zero-Rating verpflichtet. Das bedeutet, dass für die Nutzung der Corona-Warn-App das mobile Datenvolumen sowohl in Deutschland als auch innerhalb des EU-Auslands kostenfrei zur Verfügung gestellt wird. Die mobilen Daten, die die Corona-Warn-App überträgt, um Diagnoseschlüssel ('Positivkennungen') hochzuladen oder im Fall einer Risiko-Begegnung vom Backend-Server benachrichtigt zu werden, kosten Sie keinen Cent und werden nicht von Ihrem vertraglichen Datenvolumen o. ä. abgezogen.",
                            "Das Zero-Rating gilt für alle SIM-Karten, die von deutschen Netzanbietern vertrieben werden. Egal, ob diese direkt vom Mobilfunkanbieter erworben wurden oder aber von einem Partnerunternehmen (bspw. Discounter).",
                            "Für ausländische Anbieter von SIM-Karten bzw. Mobilfunktarifen können wir keine Aussage treffen. Die Entscheidung, ob die notwendigen Datenvolumina kostenfrei zur Verfügung gestellt werden oder nicht, liegt allein beim entsprechenden Anbieter."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Welche Version der COVID-19-Begegnungsaufzeichnungen habe ich?",
                        "anchor": "ENF_version",
                        "active": true,
                        "textblock": [
                            "Google veröffentlicht die Infrastruktur für die COVID-19-Begegnungsaufzeichnungen, das Exposure Notification System (ENS), über Google Play, und damit unabhängig vom Android-Betriebssystem. Die <a href='https://developers.google.com/android/exposure-notifications/doc-change-log#api-version-15' target='_blank' rel='noopener noreferrer'>ENS-Version 1.5</a> brachte einige Verbesserungen und Fehlerkorrekturen.","So sehen Sie, welche Version Ihr Smartphone installiert hat:","<ol><li>Wählen Sie in den Einstellungen 'Google > Benachrichtigungen zu möglicher Begegnung mit COVID-19-Infizierten'</li><li>Scrollen Sie auf der Seite 'COVID-19-Benachrichtigungen' ganz nach unten. Dort steht die Versionsnummer in einem der folgenden Formate:<ul><li>YYWWxxxxx, mit YY für die Jahreszahl (zum Beispiel '20') und WW für die Wochenzahl. Wenn Sie die Versionsnummer in diesem Format sehen, verwendet das Smartphone noch nicht die Version 1.5.</li><li>VVYYWWxxxxx, mit VV für die Version der Infrastruktur für COVID-19-Benachrichtigungen (zum Beispiel '15'), YY für die Jahreszahl und WW für die Wochenzahl. Wenn Sie dieses Format sehen, verwendet das Smartphone schon die Version 1.5.</li></ul></li></ol>", "Allgemeines und Release-Informationen zu den COVID-19-Benachrichtigungen finden Sie bei Google:", "<ul><li><a href='https://support.google.com/android/answer/9888358?hl=de' target='_blank' rel='noopener noreferrer'>COVID-19-Benachrichtigungen auf Ihrem Android-Smartphone aktivieren</a></li><li><a href='https://developers.google.com/android/exposure-notifications/exposure-notifications-api' target='_blank' rel='noopener noreferrer'>Exposure Notifications API</a></li><li><a href='https://developers.google.com/android/exposure-notifications/release-notes' target='_blank' rel='noopener noreferrer'>Exposure Notifications release notes</a></li><li><a href='https://developers.google.com/android/exposure-notifications/doc-change-log' target='_blank' rel='noopener noreferrer'>Exposure Notifications document change log</a></li><li><a href='https://github.com/google/exposure-notifications-internals' target='_blank' rel='noopener noreferrer'>Snapshot of code from Google Play Services's Exposure Notification module</a></li></ul>"
                        ]
                    }
                ]
            },
            {
                "title": "Grundlagen",
                "id": "general",
                "accordion": [
                    {
                        "title": "Muss ich diese App verwenden?",
                        "anchor": "have_to_use",
                        "active": true,
                        "textblock": [
                            "Nein. Die App ermöglicht zum einen den elektronischen Abruf von Testergebnissen und zum anderen hilft sie bei der Erkennung möglicher Risiko-Begegnungen (Begegnungen mit infizierten Personen). Sie können selbst entscheiden, ob Sie die Testergebnisse abrufen und ob Sie sie bei einem positiven Befund als Diagnoseschlüssel ('Positivkennung') übermitteln – nichts geschieht ohne Ihre Zustimmung.",
                            "Außerdem können Sie sowohl in der App selbst als auch in den Einstellungen Ihres Smartphones die Nutzung der COVID-19-Begegnungsaufzeichnungen deaktivieren oder die App auch jederzeit wieder vollständig deinstallieren. Bei der Deinstallation können alle aufgezeichneten Begegnungen verloren gehen, siehe <a href='#delete_random_ids' target='_blank' rel='noopener'>Werden die gesammelten Zufalls-IDs beim Deinstallieren der App entfernt?</a>."
                        ]
                    },
                    {
                        "title": "Wie oft wurde die Corona-Warn-App bisher heruntergeladen? Wie viele TeleTANs wurden ausgegeben?",
                        "anchor": "numbers_RKI",
                        "active": true,
                        "textblock": [
                            "Diese und weitere aktuelle Zahlen stellt das Robert Koch-Institut <a href='https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/WarnApp/Kennzahlen.pdf?__blob=publicationFile' target='_blank' rel='noopener noreferrer'> auf seiner Webseite</a> zur Verfügung."
                        ]
                    },
                    {
                        "title": "Welche konkreten Ziele verfolgt die Bundesregierung mit der Entwicklung einer App zur Begegnungsnachverfolgung?",
                        "anchor": "objectives",
                        "active": true,
                        "textblock": [
                            "Die Corona-Warn-App verfolgt das Hauptziel, Personen, die Begegnungen mit einer mit COVID-19 infizierten Person hatten, schnellstmöglich über diese Begegnung zu informieren. Aus epidemiologischer Sicht können die Prozesse der Begegnungsnachverfolgung beschleunigt werden, indem die Corona-Warn-App dabei unterstützt, gefährdete Personen schneller zu informieren.",
                            "Dadurch können mögliche Infektionsketten früher erkannt und unterbrochen werden. Dies kann auch dabei helfen, die bestehenden Beschränkungen zu lockern, um das gesellschaftliche Leben wieder zu normalisieren.",
                            "Neben den entscheidenden Hygiene- und Verhaltensregeln zur Vorbeugung einer Infektion und vielen anderen Maßnahmen, wie zum Beispiel der Ausweitung der Tests oder der besseren Begegnungsnachverfolgung durch Gesundheitsämter, ist die Corona-Warn-App deshalb ein weiteres Element bei der Bekämpfung der Corona-Pandemie."
                        ]
                    },
                    {
                        "title": "Welche Gründe waren am Ende ausschlaggebend dafür, den dezentralen Ansatz zur Begegnungsnachverfolgung zu favorisieren?",
                        "anchor": "reasoning_decentralized",
                        "active": true,
                        "textblock": [
                            "Im April 2020 hatte sich eine wissenschaftliche Debatte entwickelt, die in der Öffentlichkeit unter dem Schlagwort „zentrale vs. dezentrale Speicherung“ geführt wurde. Neben inhaltlich nachvollziehbaren Argumenten entwickelte sich eine teils ideologische Auseinandersetzung zur zentralen Speicherung, die das Potenzial hatte, das Vertrauen in diesen technologischen Ansatz zu gefährden.",
                            "Ein Vertrauensverlust der Bevölkerung hätte alle Bemühungen und Anstrengungen gefährdet, Infektionsketten mit digitaler Unterstützung früher erkennen und schneller unterbrechen zu können. Daher ist die Bundesregierung aktiv geworden und hat die Projektphilosophie im Sinne eines dezentralen Ansatzes angepasst."
                        ]
                    },
                    {
                        "title": "Gab es eine Risiko- sowie Kosten/Nutzen-Evaluation der beiden Varianten (zentral/dezentral) und, wenn ja, kann diese Evaluation eingesehen werden?",
                        "anchor": "cost_benefit",
                        "active": true,
                        "textblock": [
                            "Eine wissenschaftlich belastbare Evaluation liegt aufgrund der Komplexität dieser Thematik und auch aufgrund der fehlenden praktischen Erfahrung mit den zugrunde liegenden Technologien sowie aus o.g. Gründen nicht vor.",
                            "Beide Ansätze haben Vor- und Nachteile im Hinblick auf die Nutzbarkeit und wurden intensiv mit fachkundigem Personal universitärer aber auch außeruniversitärer Forschungseinrichtungen, des Robert Koch-Instituts sowie des Bundesamts für Sicherheit in der Informationstechnik (BSI) und des Beauftragten für den Datenschutz und die Informationsfreiheit (BfDI) diskutiert.",
                            "Auch bei der weiteren Entwicklung der Corona-Warn-App findet eine enge wissenschaftliche Begleitung statt."
                        ]
                    },
                    {
                        "title": "Welche konkreten Bedingungen hat die Bundesregierung den Auftragnehmern SAP und Deutsche Telekom für die Entwicklung auferlegt?",
                        "anchor": "constraints",
                        "active": true,
                        "textblock": [
                            "Gegenstand der Diskussionen waren neben der dezentralen Speicherung der Begegnungen unter Verwendung der von Google und Apple bereitgestellten Schnittstellen auch die Veröffentlichung der entwickelten Softwarekomponenten unter einer Open-Source-Lizenz.",
                            "Zudem wird die Anwendung über die offiziellen Stores von Google und Apple angeboten.",
                            "Eine weitere Anforderung für den Entwicklungsprozess war die frühzeitige und intensive Einbeziehung des BfDI und des BSI sowie eine enge Abstimmung mit diesen Stellen.",
                            "Da es sich um einen agilen Entwicklungsprozess handelt, werden die Anforderungen laufend weiterentwickelt."
                        ]
                    },
                    {
                        "title": "Wo kann ich Informationen finden, Fragen stellen oder Themen diskutieren, bei denen es um die Corona-Warn-App geht, die aber nicht entwicklungsbezogen sind?",
                        "anchor": "non_dev_related",
                        "active": true,
                        "textblock": [
                            "Im Open-Source-Projekt für die Corona-Warn-App auf <a href='https://github.com/corona-warn-app' target='_blank' rel='noopener noreferrer'>github.com/corona-warn-app</a> und auf der Website <a href='https://www.coronawarn.app/en/' target='_blank' rel='noopener noreferrer'>coronawarn.app</a> geht es viel um die Open-Source-Entwicklung der App. Informationen zu den allgemeinen Aspekten, auch rechtliche Fragen und Informationen für die nutzenden Personen gibt es auf <a href='https://www.bundesregierung.de/breg-de/themen/corona-warn-app' target='_blank' rel='noopener noreferrer'>bundesregierung.de/breg-de/themen/corona-warn-app</a>. Fragen können Sie über das <a href='https://www.bundesregierung.de/breg-de/service/kontakt' target='_blank' rel='noopener noreferrer'>Kontaktformular der Bundesregierung</a> stellen.", "Auch direkt in der Corona-Warn-App finden Sie Informationen zur Nutzung und zum Datenschutz: Gehen Sie im Menü der App auf App-Informationen, und dort auf Nutzungsbedingungen und Datenschutzinformation."
                        ]
                    },
                    {
                        "title": "Gibt es eine zentrale Stelle, die die Kontrolle über alle Begegnungsereignisse hat?",
                        "anchor": "central_entity",
                        "active": true,
                        "textblock": [
                            "Die App selbst speichert keinerlei Informationen über einzelne potenzielle Begegnungsereignisse. Das Exposure Notification System, auf dem die App aufbaut, speichert in sicherer Form die sichtbaren Rolling Proximity Identifiers (RPIs) auf den Smartphones ab, die sich innerhalb eines bestimmten Zeitraums in nächster Nähe aufgehalten haben. Selbst wenn die zentrale Infrastruktur kompromittiert wird, kann diese Information nicht zu einem Smartphone zurückverfolgt werden, wenn nicht ohnehin schon Zugriff auf das Smartphone besteht. Selbst dann kann die App selbst nicht auf die RPIs zugreifen. Auf die Diagnoseschlüssel ('Positivkennungen') kann nur mit Zustimmung der nutzenden Person zugegriffen werden, und auch dies ist nur für einen kurzen Zeitraum möglich. Vor der Verarbeitung der Daten werden die Informationen entfernt, die die Poisitivkennung und die Verbindungsmetadaten miteinander verknüpfen."
                        ]
                    },
                    {
                        "title": "Wer betreibt das Backend der App?",
                        "anchor": "backend_ops",
                        "active": true,
                        "textblock": [
                            "Das Backend der App wird von der Deutschen Telekom betrieben. Dabei kommt die <a href='https://open-telekom-cloud.com/' target='_blank' rel='noopener noreferrer'>Open Telekom Cloud (OTC)</a> zum Einsatz."
                        ]
                    },
                    {
                        "title": "Wie erfolgt die Kommunikation zwischen Server und Smartphone?",
                        "anchor": "client_server",
                        "active": true,
                        "textblock": [
                            "Die Details dazu finden Sie (in englischer Sprache) in unserem <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/solution_architecture.md' target='_blank' rel='noopener noreferrer'>Solution-Architecture-Dokument</a>."
                        ]
                    }
                ]
            },
            {
                "title": "Open Source",
                "id": "open-source",
                "accordion": [
                    {
                        "title": "Warum verfolgen wir einen Open-Source-Ansatz?",
                        "anchor": "why_oss",
                        "active": true,
                        "textblock": [
                            "Wir sind der Auffassung, dass der Erfolg der Lösung unmittelbar von der Akzeptanz und dem Vertrauen der nutzenden Personen abhängt.",
                            "Durch den gewählten Open-Source-Ansatz sind der vollständige Quelltext für die App und die Infrastruktur frei und ohne Zugangsbeschränkungen verfügbar. So möchten wir die für eine starke Vertrauensbasis notwendige Transparenz schaffen. Der Open-Source-Ansatz ermöglicht der Öffentlichkeit und der Entwicklungs-Community außerdem, aktiv zu dem Erfolg der Lösung beizutragen, z. B. in Form von Reviews und Pull Requests."
                        ]
                    },
                    {
                        "title": "Sehe ich wirklich den kompletten Code des Projekts?",
                        "anchor": "oss_complete",
                        "active": true,
                        "textblock": [
                            "Ja. Der zentrale Code in Verbindung mit der Erkennung von Begegnungen und der Weitergabefunktion ist komplett auf GitHub öffentlich verfügbar. Der Code kann sowohl vor als auch nach der Veröffentlichung der App dort überprüft und kommentiert werden. Fragestellungen zu Themen wie Sicherheit, Datenschutz usw. werden zusammen mit der Community geklärt. Jede Person kann einen eigenen Build der App erstellen und diesen testen. Abgesehen vom Quellcode diskutieren wir dort auch offen über zentrale Themen. Die Diskussionsbeiträge bleiben auf GitHub dauerhaft öffentlich einsehbar."
                        ]
                    },
                    {
                        "title": "Wie wird der Stand in GitHub auf die App in den App Stores übertragen?",
                        "anchor": "dev_status",
                        "active": true,
                        "textblock": [
                            "Die App wird über Standardwerkzeuge (z. B. Xcode, Android Studio) erstellt und dann in die jeweiligen App Stores hochgeladen.",
                            "Das Thema, ob der Code in GitHub wirklich mit der App in den jeweiligen App Stores übereinstimmt ('Reproducible Builds'), haben wir auf dem Schirm und werden entsprechende Informationen veröffentlichen, sobald sie verfügbar sind. Details zum Fortschritt findest Du im entsprechenden <a href='https://github.com/corona-warn-app/cwa-documentation/issues/14' target='_blank' rel='noopener noreferrer'>GitHub-Issue</a>."
                        ]
                    },
                    {
                        "title": "Wie kann die Entwicklungs-Community zum Projekt beitragen?",
                        "anchor": "how_to_contribute",
                        "active": true,
                        "textblock": [
                            "Das Open-Source-Projekt verwendet GitHub, einen in dem Bereich weltbekannten Onlinedienst, der Software-Entwicklungsprojekte auf seinen Servern bereitstellt. Dort können sich alle Interessierten am Projekt beteiligen, z. B. durch das Beheben von Fehlern im Code, bei der Dokumentation oder durch das Einbringen von Fragen und Kommentaren zum Projekt.",
                            "Die Zusammenarbeit innerhalb der Community unterliegt einem Code of Conduct. Alle Richtlinien zur Beteiligung findest Du <a href='/de/community/'>hier</a>."
                        ]
                    },
                    {
                        "title": "Warum GitHub und nicht eine andere Plattform?",
                        "anchor": "github",
                        "active": true,
                        "textblock": [
                            "Wir sind der Auffassung, dass GitHub eine sehr gut etablierte und entsprechend respektierte Plattform für Open-Source-Projekte ist. GitHub ist die weltweit größte Open-Source-Plattform mit über 40 Millionen registrierten Personen und mehr als 100 Millionen Repositories, davon >30 Millionen öffentlich zugänglich.",
                            "Wenn jemand keinen GitHub-Account erstellen möchte, gibt es auch ohne Account die Möglichkeit, den Code einzusehen."
                        ]
                    },
                    {
                        "title": "Welche Verhaltensregeln gelten für die Mitwirkung?",
                        "anchor": "coc",
                        "active": true,
                        "textblock": [
                            "Ein Entwicklungsprojekt in einer produktiven, kollaborierenden Community kann nur Erfolg haben, wenn wir uns gegenseitig mit Respekt begegnen. Alle Mitglieder der Projekt-Community müssen sich deshalb an einen <a href='https://github.com/corona-warn-app/cwa-documentation/blob/master/CODE_OF_CONDUCT.md' target='_blank' rel='noopener noreferrer' title=''>Code of Conduct (Verhaltenskodex)</a> halten.",
                            "Verstöße gegen den Code of Conduct können von allen Mitgliedern der Community an die Projektverantwortlichen oder an <a href='mailto:corona-warn-app.opensource@sap.com'>corona-warn-app.opensource@sap.com</a> gemeldet werden und ziehen Konsequenzen wie Verwarnung oder Ausschluss nach sich."
                        ]
                    }
                ]
            },
            {
                "id": "privacy_security",
                "title": "Datenschutz und Sicherheit",
                "accordion": [
                    {
                        "title": "Ist ein datenschutzkonformer Umgang mit den Nutzerdaten möglich?",
                        "anchor": "data_privacy",
                        "active": true,
                        "textblock": [
                            "Die dezentrale Datenspeicherung auf den Geräten garantiert Datenschutz.",
                            "Wir arbeiten sehr eng mit Experten aus der Datenschutz-Community zusammen und stimmen uns während des Entwicklungsprozesses eng miteinander ab. Zudem erarbeiteten wir ein dediziertes Dokument zur Datensicherheit, das Sie <a href='/assets/documents/cwa-datenschutz-folgenabschaetzung.pdf' target='_blank' rel='noopener noreferrer'>hier</a> auf coronawarn.app finden.",
                            "Die Quelloffenheit des Codes sorgt zudem dafür, dass die Community die Funktionsweise der App überprüfen und Anmerkungen abgeben kann."
                        ]
                    },
                    {
                        "title": "Was wird genau gespeichert und wer kann auf die über Bluetooth gesammelten Daten zugreifen?",
                        "anchor": "data_access",
                        "active": true,
                        "textblock": [
                            "Über Bluetooth werden konstant wechselnde Zufalls-IDs versendet und von den Geräten gesammelt, die die App installiert haben. Es erfolgt kein Versand und keine Speicherung von personenbezogenen Daten sowie von Geolokations- oder sonstigen ortsbezogenen Daten.",
                            "Mit Hilfe der Exposure Notification API von Google und Apple verbleiben die Zufalls-IDs in einem gesicherten Bereich des Betriebssystems des Handys. Der Abgleich, ob man einer infizierten Person begegnet ist, geschieht lokal auf dem Handy. Es verlassen keine Daten zum „Matching“ (Abgleich) das Handy.",
                            "Sobald eine Person positiv getestet wurde, wird sie gebeten, die Temporary Exposure Keys der letzten 14 Tage zu teilen. Der Zugriff auf diese Schlüssel erfolgt über die Exposure Notification API, allerdings nur dann, wenn die nutzende Person aktiv ihre Zustimmung gegeben hat."
                        ]
                    },
                    {
                        "title": "Kann ich durch Abhören des Netzwerkverkehrs als Corona-positiv identifiziert werden? ",
                        "anchor": "traffic_monitoring",
                        "active": true,
                        "textblock": [
                            "Etablierte Verschlüsselungsmechanismen wie HTTPS stellen sicher, dass Meldungen nicht von fremden Betrachtern gelesen werden können. Vor der Verarbeitung der Nutzdaten bei der Übermittlung von Diagnoseschlüsseln ('Positivkennungen') werden Metadaten entfernt. Dies verhindert, dass Daten auf der Datenbankebene miteinander verknüpft werden können.",
                            "Darüber hinaus wird es in Kürze weitere technische Maßnahmen geben, z. B. indem nach dem Zufallsprinzip unechte Meldungen erstellt und gesendet und dann im Backend wieder verworfen werden. Diese unechten Meldungen sind von den gültigen Meldungen nicht zu unterscheiden und erzeugen eine Art Hintergrundgeräusch, durch das der Sendeaufruf der TANs und das Hochladen der Infektionsdaten nicht von diesem Hintergrundgeräusch unterscheidbar sind. So kann selbst bei überwachtem Netzwerkverkehr eine plausible Abstreitbarkeit geschaffen werden."
                        ]
                    },
                    {
                        "title": "Wie ist gewährleistet, dass ich bei der Nutzung der Corona-Warn-App anonym bleibe?",
                        "anchor": "anonymous",
                        "active": true,
                        "textblock": [
                            "Die Geräte in Ihrer Nähe sammeln pseudonyme Rolling Proximity Identifiers (RPI, rollierende Näherungs-IDs). Das sind IDs, die den Datenschutz sicherstellen und sich regelmäßig in kurzen Abständen ändern und so eine Nachverfolgung des Geräts verhindern. Neben diesen speziellen IDs sammeln die Geräte in Ihrer Nähe keine weiteren Informationen von Ihrem Gerät. Diese IDs können lediglich mit ebenfalls pseudonymen Diagnoseschlüsseln ('Positivkennungen') verknüpft werden, um die Begegnungserkennung durchzuführen. Eine Verknüpfung mit Benutzerkennungen oder der Seriennummer (IMEI) Ihres Geräts ist nicht möglich.",
                            "Da sich diese IDs alle 10 bis 20 Minuten ändern, könnte z. B. eine Person, die jeden Tag im Bus neben Ihnen sitzt, Sie selbst nicht mit einer ID in Verbindung bringen, wenn die Liste der verfügbaren RPIs einsehbar wäre. Nur wenn Sie die Erlaubnis erteilen, dass Ihre Positivkennung per TeleTAN hochgeladen wird, identifizieren Sie sich auch. Diese Identifizierung dient nur der Verifizierung und legt außer den ohnehin schon vorhandenen Informationen zur Identifizierung keine weiteren Angaben offen. Sollten Sie trotzdem noch Bedenken haben, könnten Sie dafür ein anderes Gerät als das verwenden, auf dem Sie die Corona-Warn-App installiert haben.",
                            "<b>Warum wurden anfänglich Dummyschlüssel (fingierte Diagnoseschlüssel) erzeugt und genutzt?</b><br/>Eine sehr geringe Anzahl an Diagnoseschlüssel könnte möglicherweise dazu führen, dass übermittelte Diagnoseschlüssel einem einzelnen Nutzer zugeordnet werden können. Um dieses Risiko zu minimieren wurden anfangs fingierte Diagnoseschlüssel (Dummyschlüssel) erzeugt. Dadurch wurde die Anzahl der im System vorhandenen Diagnoseschlüssel erhöht, um so das beschriebene Re-Identifizierungsrisiko zu minimieren",
                            "<b>Warum kann auf die Erzeugung und Nutzung von Dummyschlüssel (fingierte Diagnoseschlüssel) nun verzichtet werden?</b><br/>Aufgrund der aktuell steigenden Infektionszahlen werden in der CWA bereits viele Diagnoseschlüssel verwaltet. Daher ist das Re-Identifizierungsrisiko aktuell als sehr gering anzusehen. Mit der Anbindung der CWA and den European Federation Gateway Service (EFGS) wird sich die Anzahl an Diagnoseschlüssel in dem System nochmal weiter erhöhen, weil auch Diagnoseschlüssel von Nutzern aus anderen Ländern hinzukommen. Aus diesem Grund kann auf die Erzeugung und Nutzung von fingierten Diagnoseschlüsseln (Dummyschlüssel) problemlos verzichtet werden.",
                            "<b>Werden erneut Dummyschlüssel (fingierte Diagnoseschlüssel) genutzt, wenn die Corona-Pandemie abklingen sollte?</b><br/>Sofern zwischenzeitlich keine besseren Alternativen gefunden werden, kann die Erzeugung der Dummyschlüssel (fingierte Diagnoseschlüssel) bei Bedarf kurzfristig aktiviert werden."
                        ]
                    },
                    {
                        "title": "Können die übermittelten Informationen zu mir und meinen früheren Aktivitäten zurückverfolgt werden?",
                        "anchor": "traceback",
                        "active": true,
                        "textblock": [
                            "Das Smartphone erzeugt so genannte Temporary Exposure Keys. Diese werden zufällig und ausschließlich lokal auf dem Gerät generiert. Es ist kryptografisch nicht möglich, zwei zufällig generierte Diagnoseschlüssel ('Positivkennungen') zu einem Gerät zurückzuverfolgen, ohne weitere Informationen zu haben oder Zugang zum sicheren Speicher des Geräts zu erhalten. Darüber hinaus werden nur Schlüssel der letzten 14 Tage gemeldet. Ein darüberhinausgehendes Weiterverfolgen ist nicht möglich oder vorgesehen."
                        ]
                    },
                    {
                        "title": "Werden Bewegungs- oder Begegnungsprofile zentral gespeichert?",
                        "anchor": "central_storage",
                        "active": true,
                        "textblock": [
                            "Weder Ihr Standort noch die Informationen über eine mögliche Begegnung zu einer infizierten Person werden zentral gespeichert. Das System weiß zu jedem Zeitpunkt nur, dass ein Diagnoseschlüssel ('Positivkennung') zu einer positiv getesteten Person gehört. Das System weiß weder, wen diese Person getroffen hat, noch wo oder wann es zu der Begegnung kam. Damit die App erkennen kann, dass eine Begegnung stattgefunden hat, ist keine Identifizierung notwendig. Eine Identifizierung ist nur erforderlich, um die Ergebnisse abzurufen und die Positivkennung zu übermitteln. Die App verbindet sich im Rahmen dieses Projekts nicht mit irgendwelchen Profilen in sozialen Medien und wird dies auch in Zukunft nicht tun."
                        ]
                    },
                    {
                        "title": "Welche personenbezogenen Daten werden in der App gespeichert?",
                        "anchor": "personal_data",
                        "active": true,
                        "textblock": [
                            "Wie in der Datenschutz-Grundverordnung (DSGVO) vorgeschrieben, ist die Datenminimierung das oberste Gebot für die Umsetzung der App. Die nutzenden Personen können und müssen in Verbindung mit der App ausschließlich die folgenden Angaben machen:",
                            "<ul><li>Zustimmung zur Nutzung des Exposure Notification Systems</li><li>Eingabe von TANs zur Verifizierung von Testergebnissen</li><li>Zustimmung zum Upload der täglichen Diagnoseschlüssel ('Positivkennungen')</li></ul>",
                            "Apps können über das Exposure Notification System keine Daten zum Standort sammeln. Die Positivkennungen werden nur für den epidemiologisch relevanten Zeitraum von 14 Tagen zentral gespeichert und nach den 14 Tagen automatisch entfernt."
                        ]
                    },
                    {
                        "title": "Ist die eingesetzte Bluetooth-Technologie wirklich sicher? Wie kann ich verhindern, dass ich mir eventuell schädliche Software einfange?",
                        "anchor": "bt_security",
                        "active": true,
                        "textblock": [
                            "Um generell die maximale Sicherheit Ihres Endgeräts zu gewährleisten, sollten Sie immer die aktuellsten Sicherheitsupdates und das neueste für Ihr Endgerät verfügbare Betriebssystem installiert haben. Dadurch stellen Sie sicher, dass Ihr Smartphone in Bezug auf die Sicherheit die neueste jeweils verfügbare Bluetooth-Spezifikation erfüllt.",
                            "Speziell bei Google/Android-Geräten sollte aktuell die Android-Version des jeweils vergangenen Monats (siehe <a href='https://source.android.com/security/bulletin' target='_blank' rel='noopener noreferrer'>Android Security Bulletins</a>) installiert sein. Detaillierte Informationen, wie Sie die jeweils aktuelle Android-Version herausfinden, finden Sie hier: <a href='https://support.google.com/android/answer/7680439?hl=de' target='_blank' rel='noopener noreferrer'>Android-Version prüfen und aktualisieren</a>."
                        ]
                    },
                    {
                        "title": "Ist das Offenlegen des Quellcodes mit diesem Open-Source-Ansatz keine Gefahr für die Cybersecurity?",
                        "anchor": "oss_dangerous",
                        "active": true,
                        "textblock": [
                            "Im Gegenteil: Die Open-Source-Community erhöht die Sicherheit der Software, da der Quellcode offen liegt und alle interessierten Personen den Code herunterladen und Zeile für Zeile überprüfen können.",
                            "Wir glauben daran, dass Sicherheit nicht durch Intransparenz gewährleistet wird. Deshalb verfolgen wir einen Open-Source-Ansatz."
                        ]
                    }
                ]
            },
            {
                "id": "resolved",
                "title": "Geklärt",
                "accordion": [
                    {
                        "title": "[Apple/iOS]: Risiko-Überprüfung fehlgeschlagen nach dem Update auf Version 1.6.0",
                        "anchor": "expcheck_160",
                        "active": true,
                        "textblock": [
                             "<b>AKTUELL</b><br/>Das Problem ist in Version 1.6.1 behoben worden.<hr/>",
                             "Nach einem Update auf Version 1.6.0 kann es vorkommen, dass Sie die Nachricht 'Risiko-Überprüfung fehlgeschlagen' erhalten, obwohl die letzte Überprüfung noch keine 24 Stunden her ist. Wir arbeiten gerade an einer Behebung dieses Problems. Bis das Update zur Verfügung steht, können Sie das Problem in den meisten Fällen mit einem Neustart Ihrer App beheben."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Migration auf neues Gerät bzw. Backup/Restore - App funktioniert nicht",
                        "anchor": "migration_Apple",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/> Dieses Problem wurde mit Version 1.5.0 behoben.<hr/> Wenn Sie Ihre Daten über iTunes auf ein neues Gerät übertragen oder ein Backup wiederhergestellt haben, funktioniert die App nicht richtig. Auf den Startseiten landen Sie in einer Endlosschleife und/oder die Risiko-Ermittlung lässt sich nicht einschalten. Der Risikostatus wird nicht angezeigt.",
                            "Das ist leider ein bekanntes Problem mit der Sicherung der Zufalls-IDs, siehe <a href='#backup' target='_blank' rel='noopener'>Werden die gesammelten Zufalls-IDs in meiner Smartphone-Datensicherung (Backup) berücksichtigt?</a>.",
                            "Bitte installieren Sie die Corona-Warn-App auf Ihrem neuen iPhone neu."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: 'COVID-19-Begegnungsaufzeichnungen' - Wöchentliches Update",
                        "anchor": "notif_weekly_update",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/>Das Verhalten der iOS Benachrichtigung zur Begegnungsmitteilung wurde mit iOS Version 13.7 geändert. Eine Benachrichtigung wird jetzt nur noch monatlich angezeigt. Die Funktion kann in den iOS Einstellungen zudem vollständig deaktiviert werden:<br/>",
                            "<ol><li>'Einstellungen' -> 'Begegnungsmitteilungen'</li><li>'Monatliches Update' ausschalten.</li></ol>",
                            "Wir bitten Sie daher, ein Update auf die aktuelle iOS Version durchzuführen.<hr/>",
                            "Das ist eine allgemeine Benachrichtigung, die nicht bedeutet, dass Risiko-Begegnungen erkannt worden sind. Es handelt sich dabei <b>nicht</b> um eine Meldung oder Funktion der Corona-Warn-App. Das Exposure Notification System (ENS) von Apple sendet diese Benachrichtigung und zeigt das Icon an. Die ENS-Schnittstelle von Apple informiert an dieser Stelle über jegliche Begegnungen mit App-Nutzern, die positiv getestet wurden - ohne eine Aussage darüber zu treffen, ob es sich um eine nach dem Schema des Robert Koch-Instituts kritische Begegnung handelte oder nicht. Es werden beispielsweise auch Begegnungen angezeigt, bei denen der Abstand mehr als 8 Meter betrug oder die nur wenige Minuten dauerten. Das heißt: Das 'Wöchentliche Update' informiert lediglich über technische Vorgänge des ENS, die für eine tatsächliche Risiko-Ermittlung unzureichend sind. Eine zuverlässige Risiko-Ermittlung findet ausschließlich in der Corona-Warn-App unter den wissenschaftlichen Rahmenbedingungen des Robert Koch-Instituts statt. Sie können Ihren aktuellen Risikostatus direkt in der Corona-Warn-App einsehen."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Fehler bei Kommunikation mit Google API (39508)",
                        "anchor": "API39508",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/>Dieser Fehler wurde mit der aktuell verfügbaren Version 1.5 der Corona-Warn-App behoben. Wir bitten Sie daher, die App entsprechend zu aktualisieren.<br/><b>WICHTIG:</b><br/><b>Nach dem Aktualisieren auf die Version 1.5 kann es bis zu 24 Stunden dauern bis das Problem behoben ist.</b>",
                            "Falls der Fehler nach dem Update auf 1.5 und 24 Stunden Wartezeit immer noch auftritt, schreiben Sie bitte einen Kommentar in das <a href='https://github.com/corona-warn-app/cwa-app-android/issues/1459' target='_blank' rel='noopener noreferrer'>dazugehörige GitHub Issue</a>.<hr/>",
                            "Die Meldung besagt, dass die Corona-Warn-App das Exposure Notification System zu oft aufgerufen hat, um die vom Server geladenen Schlüssel mit den lokal eingesammelten Zufalls-IDs abzugleichen und damit festzustellen, ob es Risiko-Begegnungen mit positiv Gemeldeten gab.",
                            "Dieses Verhalten kann durch verschiedene andere Fehler ausgelöst werden, ist jedoch immer nur eine Folgeerscheinung. Die Meldung sollte nach 24 Stunden nicht mehr angezeigt werden. Bitte halten sie die App für diesen Zeitraum geschlossen.",
                            "Wenn der Fehler danach immer noch auftritt schreiben Sie bitte einen Kommentar in das <a href='https://github.com/corona-warn-app/cwa-app-android/issues/1459' target='_blank' rel='noopener noreferrer'>dazugehörige GitHub Issue</a> und geben Sie die folgenden Informationen zu Ihrem Telefon an: <ul><li>Device name</li><li>Android version</li><li>CWA App version</li></ul>",
                            "Wir bitten sie, die App nicht zu deinstallieren oder die Google Play Dienste zurückzusetzen, da hierbei ihre aufgezeichneten Kontaktereignisse <a href='#delete_random_ids' target='_blank' rel='noopener'>verloren gehen können</a>, und eine Neuinstallation den Fehler nicht lösen kann. Darüber hinaus bitten wir Sie, die App-Daten der Corona-Warn-App nicht zu löschen, da dies das Problem in diesem Fall ebenfalls nicht löst. Sie könnten jedoch andere wichtige Daten verlieren, z. B. einen zuvor registrierten COVID-19-Test."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Ursache: 9002 Etwas ist schief gelaufen (timeout)",
                        "anchor": "cause9002_timeout",
                        "active": true,
                        "textblock": [
                            "<b>UPDATE</b><br/>Dieser Fehler wurde mit der aktuell verfügbaren Version 1.5 der Corona-Warn-App behoben. Wir bitten Sie daher, die App entsprechend zu aktualisieren.<br/><hr/>",
                            "Wenn beim Öffnen der Corona-Warn-App aktuelle Schlüssel positiv getesteter Nutzer vom Server heruntergeladen werden sollen (weil an diesem Tag noch kein automatischer Datenabgleich erfolgt war) und dabei keine Internetverbindung hergestellt werden kann, wird Ihnen möglicherweise eine Fehlermeldung 'Ursache: 9002, Etwas ist schiefgelaufen. timeout' angezeigt. Unter 'Details' wird als Ursache eine 'java.net.SocketTimeoutException' angegeben. Es sind zwei unterschiedliche Ursachen bekannt, die zu diesem Fehler führen können:",
                            "<ol><li><b>Die Internetverbindung befindet sich noch im Aufbau.</b> Wenn Sie deaktivierte Datenverbindungen (WLAN oder mobil) gerade eingeschaltet oder Ihr Smartphone neu gestartet haben und sogleich die Corona-Warn-App öffnen, wurde die Internetverbindung möglicherweise noch nicht vollständig hergestellt. Zudem gibt es spezielle Apps, die Datenverbindungen erst dann freigeben, wenn der Bildschirm angeschaltet wird. In diesen Fällen ist das Auftreten des Fehlers möglich. <b>Lösung:</b> War die Internetverbindung deaktiviert oder unterbrochen, warten Sie nach dem Einschalten der Internetverbindung einige Sekunden, bevor Sie die Corona-Warn-App öffnen. Falls Sie eine App zur Kontrolle von Datenverbindungen nutzen, stellen Sie sie so ein, dass Datenverbindungen im Hintergrund für die Corona-Warn-App freigegeben sind.</li><li><b>Die Internetverbindung wird blockiert.</b> Dies kann der Fall sein, wenn Sie entweder Datenverbindungen in den Einstellungen Ihres Smartphones manuell eingeschränkt haben oder wenn Datenverbindungen für die Corona-Warn-App von einer Antivirus-App und/oder einer Firewall automatisch deaktiviert wurden. <b>Lösung:</b> Geben Sie in den Einstellungen Ihres Smartphones (Netzwerk und Internet, Mobile Daten und WLAN) für die Corona-Warn-App die Datennutzung im Allgemeinen, sowie Hintergrunddaten und uneingeschränkte Datennutzung frei. Falls Sie eine Antivirus-App und/oder eine Firewall auf Ihrem Smartphone nutzen, stellen Sie sie so ein, dass für die Corona-Warn-App keine Einschränkungen in der Datennutzung bestehen.</li></ol>",
                            "In dem <a href='https://github.com/corona-warn-app/cwa-app-android/issues/998' target='_blank' rel='noopener noreferrer'>GitHub-Issue 998</a> finden Sie weitere Informationen (englisch)."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Ursache: 9002 Etwas ist schief gelaufen (sqlite)",
                        "anchor": "cause9002",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/>Dieser Fehler wurde mit der aktuell verfügbaren Version 1.5 der Corona-Warn-App behoben. Wir bitten Sie daher, die App entsprechend zu aktualisieren.<br/><hr/>",
                            "Es kommt auf einzelnen Geräten (z.B. dem Huawei P20 Pro) zu Problemen beim Zugriff auf den verschlüsselten Bereich der App-Datenbank, in der Informationen zum Risiko-Status und der letzten Aktualisierung abgelegt sind. In der Regel zeigt sich dieser Fehler durch die Ursache 9002 und Hinweise auf die verwendete Datenbank (database), SQLite, sqlite_master, eine Security-Exception oder einen Fehler bei der Entschlüsselung (decryption). Das kann manchmal dazu führen, dass Sie die App nicht mehr öffnen können.",
                            "Wir arbeiten daran, die Ursache zu finden und zu beheben. Details dazu finden Sie im GitHub-Issue <a href='https://github.com/corona-warn-app/cwa-app-android/issues/642' target='_blank' rel='noopener noreferrer'>https://github.com/corona-warn-app/cwa-app-android/issues/642</a>. Dort werden wir auch Fehlerbehebungen und weitere Hinweise veröffentlichen.",
                            "Wenn Ihr Smartphone-Typ in diesem GitHub-Issue noch nicht genannt ist, schreiben Sie uns bitte den Typ in einem Kommentar. Das hilft uns, die Ursache zu bestimmen. Wenn das GitHub-Issue nicht auf Ihren Fehler mit der Ursache 9002 zutrifft, legen Sie gerne einen <a href='https://github.com/corona-warn-app/cwa-app-android/issues/new?labels=bug&template=01_bugs.md' target='_blank' rel='noopener noreferrer'>neuen Issue</a> an.",
                            "<b>Falls Sie die App nicht mehr öffnen können, lesen Sie bitte den Abschnitt <a href='#app_crash' target='_blank' rel='noopener'>'Die Corona-Warn-App schließt sich sofort nach dem Öffnen'</a>.</b>"
                        ]
                    },
                    {
                        "title": "[Google/Android]: Die Corona-Warn-App schließt sich sofort nach dem Öffnen",
                        "anchor": "app_crash",
                        "active": true,
                        "textblock": [
                            "<b>AKTUELL</b><br/>Dieser Fehler wurde mit der aktuell verfügbaren Version 1.5 der Corona-Warn-App behoben. Wir bitten Sie daher, die App entsprechend zu aktualisieren.<br/><hr/>",
                            "Wenn die Corona-Warn-App durch einen Fehler im Betriebssystem oder durch aggressive Energiesparmaßnahmen des Telefons unerwartet beendet wird, kann es vorkommen, dass bei einem erneuten Start die Corona-Warn-App nicht mehr auf ihre verschlüsselten Datenbanken zugreifen kann. In diesem Fall schließt sie sich sofort wieder. Manchmal wurde vorher der <a href='#cause9002' target='_blank' rel='noopener'>Fehler Ursache: 9002 Etwas ist schief gelaufen (sqlite)</a> angezeigt.",
                            "Wir arbeiten mit Hochdruck an einer Lösung des Problems.",
                            "Die GitHub-Community hat eine Notfall-Lösung erarbeitet, die die Corna-Warn-App ohne Deinstallation wieder zum Laufen bringt. Da hierbei jedoch Daten verloren gehen können (z. B. registrierte COVID-19-Tests zur Online-Abfrage der Testergebnisse), sollten Sie diese Notfall-Lösung nur dann anwenden, wenn keine anderen Maßnahmen (insbesondere Vorschläge von der technischen Telefon-Hotline oder von Betreuern der Corona-Warn-App im Google Play Store) geholfen haben, und Sie die Hinweise zur Notfall-Lösung im GitHub-Issue vollständig zur Kenntnis genommen haben.",
                            "<a href='https://github.com/corona-warn-app/cwa-app-android/issues/1053#issuecomment-690614975' target='_blank' rel='noopener noreferrer'>Hier geht es zur Notfall-Lösung im GitHub-Issue</a>."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Risiko-Begegnungen werden länger als 14 Tage angezeigt",
                        "anchor": "status_14",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Dieser Fehler wurde in Version 1.2 behoben. Risiko-Begegnungen werden Ihnen bis zu 14 Tage nach dem Zeitpunkt der Begegnung mit dem Nutzer, der dann ein positives COVID-19-Testergebnis in der Corona-Warn-App gemeldet hat, angezeigt.",
                            "Bei einigen Android-Smartphones kommt es aktuell vor, dass die Risiko-Begegnungen länger als 14 Tage angezeigt werden. Wir arbeiten an der Behebung dieses Anzeigefehlers. Aktuelle Informationen finden Sie auf Englisch im <a href='https://github.com/corona-warn-app/cwa-app-android/issues/911' target='_blank' rel='noopener noreferrer'>GitHub-Issue 911</a>."
                        ]
                    },
                     {
                        "title": "[Google/Android]: Anzahl der Schlüssel auf 0 zurückgesetzt",
                        "anchor": "keys0",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Dieser Anzeigefehler wurde über ein Update der Google Play Services behoben, siehe <a href='https://github.com/corona-warn-app/cwa-app-android/issues/744#issuecomment-659255917' target='_blank' rel='noopener noreferrer'>diesen GitHub-Kommentar</a> in englischer Sprache.",
                            "Das ist ein bekannter Anzeigefehler. Die App funktioniert nach wie vor. Wir arbeiten gerade gemeinsam mit Google an der Lösung."
                        ]
                    },
                    {
                        "title": "Wann ist die App fertig?",
                        "anchor": "when_ready",
                        "active": true,
                        "textblock": [
                            "Die App steht seit dem 16. Juni 2020 im App Store von Apple bzw. im Google Play Store zum Download zur Verfügung. Der Entwicklungsfortschritt kann weiterhin in den einzelnen Code-Repositories verfolgt werden."
                        ]
                    },
                    {
                       "title": "[Apple/iOS]: Probleme nach Update auf iOS 13.6",
                       "anchor": "iOS_136",
                       "active": true,
                       "textblock": [
                            "AKTUELL: Mittlerweile hat Apple die iOS-Version 13.6.1 veröffentlicht, die dieses Problem behebt. Bitte aktualisieren Sie Ihr Smartphone auf iOS 13.6.1.",
                           "In der iOS-Version 13.6 konnte auf einigen Geräten die Risiko-Ermittlung nicht mehr aktiviert werden, da Begegnungsaufzeichnungen in ihrer Region nicht verfügbar seien. Details dazu finden Sie im GitHub-Issue <a href='https://github.com/corona-warn-app/cwa-app-ios/issues/911' target='_blank' rel='noopener noreferrer'>https://github.com/corona-warn-app/cwa-app-ios/issues/911</a>."   ]
                    },
                    {
                        "title": "[Apple/iOS] Nach dem Update auf 1.2.0 kann ich die App nicht mehr öffnen",
                        "anchor": "app_does_not_open",
                        "active": true,
                        "textblock": [
                           "AKTUELL: Inzwischen steht die App-Version 1.2.1 zur Verfügung, die dieses Problem behebt. Bitte aktualisieren Sie die App.",
                           "Mit dem Update auf 1.2.0 trat bei vielen Nutzern das Problem auf, dass sie die Corona-Warn-App nicht mehr öffnen konnten."
                        ]
                    },
                    {
                        "title": "[Google/Android] Der Text für das niedrige Risiko ist widersprüchlich",
                        "anchor": "low_risk_text",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Dieser Fehler ist bereits korrigiert. Die Korrektur ist ab App-Version 1.2.1 verfügbar. Bitte aktualisieren Sie die App.",
                            "In dem erklärenden Text für ein niedriges Infektionsrisiko wurde mit dem letzten Update eine sich widersprechende Beschreibung eingefügt. Wenn Sie eine Risiko-Begegnung hatten, die App aber weiter ein niedriges Risiko für Sie anzeigt, dann wird die Infektionswahrscheinlichkeit für Sie als niedrig eingestuft und nicht wie im Text derzeit geschrieben als erhöht."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Falsche Anzeige der Zahl aktiver Tage",
                        "anchor": "days_active_Apple",
                        "active": true,
                        "textblock": [
                            "Aktuell: Dieser Anzeigefehler ist inzwischen behoben. Bitte aktualisieren Sie die Corona-Warn-App auf die neueste Version. Die App zählt jetzt die aktiven Tage weiter, bis sie, wie vorgesehen, 14 erreicht hat.",
                            "Bei der Zählung der aktiven Tage gibt es derzeit einen Fehler, der dazu führt, dass bei Erreichen von '14 von 14 Tagen aktiv' die Anzeige der Anzahl aktiver Tage nicht bei 14 von 14 Tagen bleibt, sondern statisch auf „13 von 14 Tagen aktiv“ oder weniger stehen bleibt.",
                            "Dieser Fehler betrifft nur die Anzeige der aktiven Tage in der Corona-Warn-App. Die Funktion selbst ist nicht eingeschränkt, das heißt, die Schlüssel werden weiterhin ausgetauscht und die Risiko-Ermittlung wird weiterhin durchgeführt. Es gehen keine Daten verloren. Technisch gesehen handelt es sich hier um einen Rundungsfehler, der auftritt, wenn die Anzahl aktiver Tage der Risiko-Ermittlung nicht mehr zunimmt, sondern statisch bei 14 Tagen bleibt. Wenn die Risiko-Ermittlung auch nur kurzfristig in irgendeiner Form nicht aktiv war, bleibt der Zähler bei einem niedrigeren Wert, also etwa bei 13 Tagen stehen.",
                            "Mögliche Ursachen für eine Deaktivierung der Risiko-Ermittlung:",
                            "<ol><li>Bluetooth wurden deaktiviert, auch nur für einen kurzen Zeitraum</li><li>Die Hintergrundaktualisierung für die App war nicht aktiv, so dass nicht immer eine Risiko-Ermittlung durchgeführt wurde</li><li>Der Flugmodus wurde eingeschaltet, auch nur für einen kurzen Zeitraum</li><li>Das Smartphone war ausgeschaltet</li><li>Das Smartphone wurde neu gestartet</li></ol>",
                            "Detaillierte Informationen dazu stehen <a href='https://github.com/corona-warn-app/cwa-app-android/issues/796#issuecomment-653061512' target='_blank' rel='noopener noreferrer'>in diesem Kommentar auf GitHub</a> (englisch)."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Falsche Anzeige der Zahl aktiver Tage",
                        "anchor": "days_active_Android",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Diese Anzeige ist inzwischen aktualisiert. Sollte dennoch eine andere Zahl der Tagen angezeigt werden, siehe <a href='#exposure_check' target='_blank' rel='noopener'> Aufzeichnungen von weniger als 14 Tagen gespeichert</a>.",
                            "Bei der Zählung der aktiven Tage gibt es derzeit einen Fehler, der dazu führt, dass bei Erreichen von '14 von 14 Tagen aktiv' die Anzeige der Anzahl aktiver Tage nicht bei 14 von 14 Tagen bleibt, sondern statisch auf „13 von 14 Tagen aktiv“ oder weniger stehen bleibt.",
                            "Dieser Fehler betrifft nur die Anzeige der aktiven Tage in der Corona-Warn-App. Die Funktion selbst ist nicht eingeschränkt, das heißt, die Schlüssel werden weiterhin ausgetauscht und die Risiko-Ermittlung wird weiterhin durchgeführt. Es gehen keine Daten verloren. Technisch gesehen handelt es sich hier um einen Rundungsfehler, der auftritt, wenn die Anzahl aktiver Tage der Risiko-Ermittlung nicht mehr zunimmt, sondern statisch bei 14 Tagen bleibt. Wenn die Risiko-Ermittlung auch nur kurzfristig in irgendeiner Form nicht aktiv war, bleibt der Zähler bei einem niedrigeren Wert, also etwa bei 13 Tagen stehen.",
                            "Mögliche Ursachen für eine Deaktivierung der Risiko-Ermittlung:",
                            "<ol><li>Bluetooth und die Standortermittlung wurden deaktiviert, auch wenn es nur ein kurzer Zeitraum ist</li><li>Die Hintergrundaktualisierung für die App war nicht aktiv, so dass nicht immer eine Risiko-Ermittlung durchgeführt wurde</li><li>Der Flugmodus wurde eingeschaltet, auch wenn es nur über einen kurzen Zeitraum war</li><li>Das Smartphone war ausgeschaltet</li><li>Das Smartphone wurde neu gestartet</li></ol>",
                            "Es ist geplant, dass die Lösung im nächsten Release enthalten sein wird.",
                            "Detaillierte Informationen dazu stehen <a href='https://github.com/corona-warn-app/cwa-app-android/issues/796#issuecomment-653061512' target='_blank' rel='noopener noreferrer'>in diesem Kommentar auf GitHub</a> (englisch)."
                        ]
                    },
                    {
                        "title": "Warum stoppt die Anzeige bei \"14 von 14 Tagen aktiv\"? Was bedeutet \"14 von 14 Tagen aktiv\" überhaupt?",
                        "anchor": "days_active_explanation",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Diese Anzeige ist inzwischen aktualisiert. Sollte dennoch eine andere Zahl der Tagen angezeigt werden, siehe <a href='#exposure_check' target='_blank' rel='noopener'> Aufzeichnungen von weniger als 14 Tagen gespeichert</a>.",
                            "Die Corona-Warn-App sammelt immer die Kontakte der letzten 14 Tage. Alle älteren Kontakte sind für die Risiko-Ermittlung nicht relevant und werden daher auch gelöscht. Somit wird Ihnen immer \"14 von 14 Tagen aktiv\" angezeigt werden, wenn die App im gesamten Zeitraum aktiv war. Die Zählung beginnt nach 14 Tagen nicht von vorn. Sofern also Ihre Risiko-Ermittlung aktiv ist und auch ein Risiko-Status angezeigt wird, funktioniert die Corona-Warn-App so, wie sie soll.",
                            "Sollten sie die App nach Erreichen der 14 Tage deaktivieren, kann die Anzeige auch zurückspringen auf 13 (oder weniger) aktive Tage. Dies kann z.B. durch eine der folgenden Aktionen ausgelöst werden:<ul><li>Bluetooth deaktivieren</li><li>Hintergrundaktualisierung für die App abschalten, sodass nicht immer eine Risiko-Ermittlung durchgeführt wurde</li><li>Einschalten des Flugmodus</li><li>Ausschalten des Smartphones</li><li>Neustart des Smartphones</li></ul>"
                        ]
                    },
                    {
                        "title": "[Google/Android]: URSACHE 3 – Etwas ist schief gelaufen. Fehler bei Kommunikation mit Google API(10)",
                        "anchor": "API10",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Dieser Fehler ist mit der Version 1.5 des Exposure Notification Systems behoben. So sehen Sie nach, welche Version Sie installiert haben: <a href='#ENF_version' target='_blank' rel='noopener'>Welche Version des COVID-19-Kontaktprotokolls habe ich?</a>",
                            "Der Fehler (10) in Zusammenhang mit der fehlenden Risiko-Ermittlung wird aktuell gemeinsam mit Google behoben. Wir können Ihnen aber bestätigen, dass Ihre Kontakte weiterhin aufgezeichnet werden. Daher würden wir Sie bitten, die App nicht zu löschen, da hierbei ihre aufgezeichneten Kontaktereignisse verloren gehen können, siehe auch <a href='#delete_random_ids' target='_blank' rel='noopener'>https://www.coronawarn.app/de/faq/#delete_random_ids</a>."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: ENErrorDomain-Fehler 5",
                        "anchor": "ENError5",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Der Fehler ENErrorDomain 5 kommt vom Exposure Notification System, das von Apple bereitgestellt und von der App genutzt wird. Nach Angaben von Apple wurde die Ursache, die zu diesem Fehler führte, inzwischen behoben, sodass er in Zukunft nicht mehr vorkommen sollte. Falls der Fehler immer noch auftritt, bitten wir Sie um etwas Geduld, bis die Änderung auf Ihrem Gerät ankommt."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: ENErrorDomain-Fehler 11",
                        "anchor": "ENError11",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Obwohl nach Apples Angaben dieser Fehler mit iOS 13.6 behoben wurde, taucht er nun wieder auf Geräten, welche iOS 14 oder neuer installiert haben, auf. Um den Fehler zu beheben, gehen Sie bitte in die iOS Einstellungen und klicken dort auf den Punkt: 'Begegnungsmitteilungen', scrollen ganz nach unten und klicken auf 'Begegnungsmitteilungen deaktivieren'. Warten Sie einen Moment und schalten Sie Begegnungsmitteilungen wieder an.",
                            "Der Fehler ENErrorDomain 11 kommt aus dem Exposure Notification System, das von Apple bereitgestellt und von der App genutzt wird."
                        ]
                    },
                    {
                       "title": "[Apple/iOS]: ENErrorDomain-Fehler 13",
                       "anchor": "ENError13",
                       "active": true,
                       "textblock": [
                           "AKTUELL: Wenn Sie auf iOS-Version 13.6. aktualisiert haben, ist dieser Fehler behoben.",
                           "Der Fehler ENErrorDomain 13 kommt aus dem Exposure Notification System, das von Apple bereitgestellt und von der App genutzt wird. Es handelt sich dabei um eine Information, dass an diesem Tag bereits eine Risikoanalyse durchgeführt worden ist. Bitte starten Sie Ihr iPhone neu, und lassen die Corona-Warn-App für 24 Stunden geschlossen, dann wird erneut eine Risikoanalyse durchgeführt und dieser Fehler sollte nicht mehr angezeigt werden. Bitte deinstallieren Sie die Corona-Warn-App nicht, sie funktioniert weiterhin."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Ich bekomme folgende Benachrichtigung: 'Region für Kontaktmitteilung geändert. COVID-19-Kontaktmitteilungen werden von \"Corona-Warn\" in dieser Region möglicherweise nicht unterstützt'",
                        "anchor": "iphone_region_change",
                        "active": true,
                        "textblock": [
                           "AKTUELL: Wenn Sie auf iOS-Version 13.6. aktualisiert haben, ist diese Meldung behoben.",
                           "Diese Nachricht wird direkt vom Betriebssystem bzw. dem Exposure Notification System ausgelöst. Sie können die Meldung mit 'OK' bestätigen, die Kontaktermittlung funktioniert ganz normal. Um dies zu prüfen, können Sie in den Geräte-Einstellungen unter 'Datenschutz' > 'Health' > 'COVID-19-Kontaktprotokoll' (iOS 13.7 und höher: 'Einstellungen' > 'Begegnungsmitteilungen' > 'Status von Begegnungsaufzeichnungen') den Status der Kontaktermittlung überprüfen. Es handelt sich um einen iOS-Fehler. Apple arbeitet bereits an einer Lösung, die voraussichtlich mit dem nächsten iOS-Update ausgeliefert wird.",
                            "Bitte öffnen Sie die Corona-Warn-App noch ein Mal kurz, um sicherzustellen, dass die Hintergrundaktualisierung weiter arbeitet."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: Zu wenig Speicherplatz",
                        "anchor": "memory",
                        "active": true,
                        "textblock": [
                            "AKTUELL: Diese Fehlermeldung kommt aus dem Betriebssystem. Wenn Sie auf Apple iOS-Version 13.6. aktualisiert haben, sollte der Fehler weniger häufig auftreten.",
                            "Die Corona-Warn-App benötigt nur ca. 20 MB Speicherplatz auf dem Handy. Die Größe kann sich durch eventuelle Updates laufend verändern (wenn auch nur minimal). Zusätzlich fallen weitere Speicherkapazitäten durch die von der App zwischengespeicherten Daten an."
                        ]
                    },
                    {
                        "title": "[Google/Android]: Ich bekomme beim Einrichten der App folgenden Fehler: URSACHE: 3. Etwas ist schief gelaufen. Fehler bei Kommunikation mit Google API(17). Was bedeutet das?",
                        "anchor": "cause_3",
                        "active": true,
                        "textblock": [
                           "AKTUELL: Dieser Fehler ist inzwischen behoben.",
                            "Dieser Fehler kann bei der ersten Aktivierung der Risiko-Ermittlung oder auch später in den App-Einstellungen oder auf dem Hauptbildschirm auftreten. Der Fehler bedeutet, dass Ihr Gerät aus einem oder mehreren der folgenden Gründe die Risiko-Ermittlung nicht durchführen kann:",
                            "<ul><li>Ihre Google Play-Dienste sind veraltet.</li><li>Die App ist nicht in der Landesversion Ihres Google Play verfügbar. <a href='https://www.coronawarn.app/de/faq/#international' target='_blank' rel='noopener noreferrer'>Diese FAQ</a> nennt die unterstützten Landesversionen.</li><li>Sie haben die Corona-Warn-App nicht über den offiziellen Google Play Store installiert.</li><li>Ihr Gerät wurde modifiziert (z. B. gerootet).</li><li>Sie haben mehrere Benutzerkonten auf Ihrem Gerät, und die App wird für einen nicht-primären Nutzer (ohne Administrationsrechte) ausgeführt.</li><li>Der Hersteller Ihres Geräts hat die Google Play-Dienste und den Google Play Store für Ihr Gerät nicht zur Verfügung gestellt (betrifft z. B. einige Modelle von Huawei und Xiaomi).</li><li>Die Google Mobile Services sind veraltet.</li></ul>",
                            "<b>Fehlerbehebung</b>",
                            "Viele betroffene Nutzer konnten den Fehler durch eine dieser Möglichkeiten beheben:",
                            "<ol><li>Aktualisieren der Google Play-Dienste auf die neueste Version. Siehe: <a href='https://play.google.com/store/apps/details?id=com.google.android.gms&hl=de' target='_blank' rel='noopener noreferrer'>Google Play-Dienste</a>. In den Geräte-Einstellungen unter 'Apps & Benachrichtigungen' > 'Google Play-Dienste' > 'Erweitert' können Sie ganz unten die Version überprüfen. Beachten Sie hierzu auch den Hinweis zu den Google Mobile Services unten in dieser Antwort.</li><li>Leeren des Cache der Google Play-Dienste in den Geräte-Einstellungen unter 'Apps & Benachrichtigungen' > 'Google Play-Dienste' > 'Speicher' > 'Cache leeren'.</li><li>Ändern der Landesversion von Google Play auf Deutschland wie hier beschrieben: <a href='https://support.google.com/googleplay/answer/7431675?hl=de' target='_blank' rel='noopener noreferrer'>Google Play-Landesversion ändern</a>.</li><li>Prüfen, ob das Gerät generell die Risiko-Ermittlung in Deutschland unterstützt: In den Geräte-Einstellungen unter 'Google' > 'Benachrichtigungen zu möglicher Begegnung mit COVID-19-Infizierten' sollte die Corona-Warn-App aufgeführt sein.</li><li>Sicherstellen, dass das Benutzerkonto, mit dem Sie das Gerät verwenden, Administratorrechte hat: Geräte-Einstellungen > 'System' > 'Erweitert' > 'Mehrere Nutzer'.</li><li>Vor der Installation sicherstellen, dass eine Internetverbindung besteht und Bluetooth sowie die allgemeine Standortverwendung aktiviert sind (siehe auch <a href='#android_location' target='_blank' rel='noopener noreferrer'>hier</a>).</li><li>Gerät neu starten.</li><li>Wenn alles andere nicht geholfen hat, weil so die bereits gesammelten Zufalls-IDs gelöscht werden können (<a href='#delete_random_ids' target='_blank' rel='noopener'>https://www.coronawarn.app/de/faq/#delete_random_ids</a>): Deinstallieren der Corona-Warn-App und neu installieren über den Google Play Store (<a href='https://play.google.com/store/apps/details?id=de.rki.coronawarnapp&hl=de&showAllReviews=true' target='_blank' rel='noopener noreferrer'>Corona-Warn-App</a>).</li></ol>",
                            "Wenn der Fehler weiterhin auftritt, obwohl Sie alle Schritte ausgeführt haben, aktiviert Ihr Gerät die Risiko-Ermittlung möglicherweise etwas zeitverzögert. Bitte schließen Sie die Corona-Warn-App, warten zwei Stunden und versuchen es dann erneut.",
                            "Hinweis zu den Google Mobile Services: Damit die Corona-Warn-App funktioniert, muss Google die Google Mobile Services auf Ihrem Gerät automatisch aktualisieren. Sie können das nicht tun. Wenn Sie die Google Play-Dienste auf die neueste Version aktualisiert haben, wie oben beschrieben, müssen Sie noch auf das automatische Update der Google Mobile Services warten. Versuchen Sie es in diesem Fall am nächsten Tag wieder.",
                            "Wir entwickeln die Corona-Warn-App ständig weiter und versuchen, mögliche Ursachen für diesen Fehler in der App zu beheben."
                        ]
                    },
                    {
                        "title": "[Apple/iOS]: In den Einstellungen für die COVID-19-Begegnungsaufzeichnungen steht: 'Corona-Warn hat dein Protokoll mit erfassten zufälligen IDs während der letzten 24 Stunden 0-mal überprüft'. Funktioniert die Risiko-Ermittlung nicht?",
                        "anchor": "no_log_check",
                        "active": true,
                        "textblock": [
                           "AKTUELL: Diese Meldung wird nicht mehr angezeigt, seitdem Positivkennungen auf dem Server verfügbar sind.", "Doch, die Risiko-Ermittlung funktioniert. Dieser Hinweis steht unter 'Einstellungen' > 'Datenschutz' > 'Health' > 'COVID-19-Begegnungsaufzeichnungen' (iOS 13.7 und höher: 'Einstellungen' > 'Begegnungsmitteilungen' > 'Status von Begegnungsaufzeichnungen'). Er kommt von iOS und bedeutet, dass der Backend-Server noch keine Diagnoseschlüssel (Positivkennungen) an Ihr Gerät versendet hat. Die Corona-Warn-App hat deswegen noch keinen Abgleich mit den gesammelten Zufalls-IDs durchgeführt. Sobald Corona-positiv getestete Personen ihren Diagnoseschlüssel (Positivkennung) hochgeladen haben, wird dieser Abgleich ausgelöst."
                        ]
                    },
                    {
                        "title": "Exposure Notification Express (ENE)",
                        "anchor": "ene",
                        "active": true,
                        "textblock": [
                            "Exposure Notification Express (ENE) wurde von Google und Apple zusätzlich entwickelt, um Gesundheitsbehörden weltweit zu unterstützen, die noch keine App haben und eine App nicht selber entwickeln können oder wollen. ENE stellt standardisierte Covid-19-Benachrichtigungen einfach zur Verfügung, digitalisiert aber darüber hinaus nicht den Prozess bis zum Testergebnis.",
                            "So können zwar Risikobegegnungen angezeigt werden, bei einem positiven Testergebnis ohne weitere Verifikation die Diagnoseschlüssel aber nicht übermittelt werden. Auch lassen sich Testergebnisse mit ENE nicht übermitteln.",
                            "Für die deutsche Corona-Warn-App (CWA) ändert sich durch die Einführung von Exposure Notifications Express aktuell nichts. Regionen, die eine an den eigenen Bedarf angepasste App betreiben, erhalten die Begegnungsmitteilungen aus dem Exposure Notification System weiterhin direkt und exklusiv. Alle Begegnungsmitteilungen werden in Deutschland ausschließlich in die CWA geleitet. Die hohen deutschen Standards für Datenschutz greifen. Die Risikoermittlung erfolgt in Deutschland ausschließlich nach den epidemiologischen Vorgaben des Robert-Koch-Instituts (RKI). Die Nutzer*innen erhalten bei Bedarf persönliche Unterstützung durch die Hotlines.",
                            "Die eigene App statt der Standardlösung ENE bietet Ländern nach aktuellem Kenntnisstand folgende Vorteile:",
                            "<ul><li>Flexibler Verifikationsprozess</li><li>Integrierte Laboranbindung, schnellerer Benachrichtigungsprozess</li><li>Datenschutzkonformität</li><li>Gesetzkonformität, z.B. Altersfreigabe</li><li>EU-Interoperabilität mit Rechtssicherheit und Datenschutz</li><li>Integration von Hotlines</li><li>Backend-Server müssen nach wie vor betrieben werden</li><li>Parametrisierung (z.B. wann eine Begegnung als Risiko bewertet wird, kommt nicht von Google/Apple, sondern kann jedes Land selbst definieren)</li></ul>"
                        ]
                    },
                    {
                        "title": "Wann wurden diese FAQ zuletzt aktualisiert?",
                        "anchor": "update_faq",
                        "active": true,
                        "textblock": [
                            "Stand: [last-update]"
                        ]
                    }
                ]
            }
        ]
    }
}
