{
    "meta": {
        "title": "Datenschutzerklärung",
        "description": ""
    },
    "section-main": {
        "headline": {
            "title": "Datenschutzerklärung"
        },
        "content": {
            "textblock": [
                "Der Schutz der Privatsphäre im Internet ist von entscheidender Bedeutung für die Zukunft internetbasierter Geschäftsmodelle und für die Entwicklung einer internetbasierten Wirtschaft. SAP hat diese Datenschutzerklärung erarbeitet, um die entschiedene Verpflichtung zum Schutz der Daten und der Privatsphäre des Einzelnen unter Beweis zu stellen. Um Deine Privatsphäre zu schützen, verwendet SAP eine breite Definition für personenbezogene Daten, die auf den Gesetzen und Verordnungen der EU zum Thema Schutz der Privatsphäre basiert, einschließlich der Datenschutz-Grundverordnung. Diese wird gemeinhin als die strengste Regelung zum Schutz der Rechte des Einzelnen auf Datenschutz und Privatsphäre angesehen. Daher gelten für SAP sämtliche Informationen über Dich und Dein Verhalten, die auf Dich zurückverfolgt werden können, als personenbezogene Daten.",
                "Diese Website coronawarn.app sammelt, verarbeitet, protokolliert, verwendet und speichert keine personenbezogenen Daten.",
                "Darüber hinaus erfasst diese Website im Gegensatz zu vielen anderen Websites nicht Deine IP-Adresse oder andere technische Informationen wie Browsertyp und -version, Browser-Plug-in-Typen oder Betriebssysteme und Plattformen. Die Website sammelt nur Informationen über Deine Browseranfragen, die keine Identifizierung personenbezogener Daten ermöglichen, z.B. Deine Spracheinstellung. Diese Informationen werden aber nur für die Dauer Deines Besuchs der Website gespeichert oder verwendet und können nicht auf Dich zurückverfolgt werden. Diese Website platziert oder verwendet keine Cookies oder ähnliche Tracking-Technologien, um Informationen über Dich zu sammeln."
            ],
            "textcaption": "Letzte Aktualisierung: 18. Mai 2020"
        }
    }
}
