{
  "en": {
    "section-notice": {
        "textblock": [
            "<div class='update'>Evaluation of the Corona-Warn-App continues and new science blogs will continue to be published on this site after CWA development ends on Mai 31, 2023. For more information, click here: <a href='../faq/results/#ramp_down' target='_blank'> What is the background for the end of the development of the CWA?</a></div>"
        ]
    },
    "headline": {
      "title": "Science Blog",
      "text": "The Corona-Warn-App (CWA) is one of the measures that has been put in place to contain the pandemic since June 2020. How effective is the app as a digital tool and what are its benefits? We will be using this blog to publish answers to these questions as well as results from the research undertaken by the Robert Koch Institute."
    },
    "baseSlug": "science",
    "dateFormat": "MMMM Do YYYY",
    "readMore": "Read more",
    "backToIndexButton": {
      "title": "Back to Science Blog",
      "url": "/en/science",
      "external": false
    },
    "mobileMessage": "This page is optimized for mobile devices, i.e. graphics are shown as static images.",
    "archiveButton": {
      "title": "Show news archive",
      "url": "archive",
      "external": false
    }
  },
  "de": {
    "section-notice": {
        "textblock": [
            "<div class='update'>Die Evaluation der Corona-Warn-App geht weiter und neue Science-Blogs werden auch nach dem Ende der CWA-Entwicklung am 31. Mai 2023 auf dieser Seite veröffentlicht. Weitere Informationen finden Sie hier: <a href='../faq/results/#ramp_down' target='_blank'>Was ist der Hintergrund für das Ende der Entwicklung der CWA?</a></div>"
        ]
    },
    "headline": {
      "title": "Science-Blog",
      "text": "Seit Juni 2020 ist die Corona-Warn-App ein Baustein bei der Eindämmung der Pandemie. Aber wie wirkt das digitale Tool wirklich und welchen Nutzen bringt es? Wir werden Antworten darauf und Ergebnisse der wissenschaftlichen Evaluation durch das Robert Koch-Institut hier im Blog veröffentlichen."
    },
    "baseSlug": "science",
    "readMore": "Weiterlesen",
    "backToIndexButton": {
      "title": "Zurück zum Science-Blog",
      "url": "/de/science",
      "external": false
    },
    "mobileMessage": "Diese Seite ist für Mobilgeräte optimiert, d.&nbsp;h. Grafiken werden als statische Bilder angezeigt.",
    "archiveButton": {
      "title": "Zum News Archiv",
      "url": "archiv",
      "external": false
    }
  }
}
